HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
/*******************************************************************************
**                                                                            **
** Copyright (C) Infineon Technologies (2015)                                 **
**                                                                            **
** All rights reserved.                                                       **
**                                                                            **
** This document contains proprietary information belonging to Infineon       **
** Technologies. Passing on and copying of this document, and communication   **
** of its contents is not permitted without prior written authorization.      **
**                                                                            **
********************************************************************************
**                                                                            **
**   $FILENAME   : SpiSlave.c $                                               **
**                                                                            **
**   $CC VERSION : \main\58 $                                                 **
**                                                                            **
**   $DATE       : 2015-04-23 $                                               **
**                                                                            **
**   AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                            **
**   VENDOR      : Infineon Technologies                                      **
**                                                                            **
**   DESCRIPTION : This file contains                                         **
**                 - functionality of SPISlave driver.                        **
**                                                                            **
**   MAY BE CHANGED BY USER [yes/no]: No                                      **
**                                                                            **
*******************************************************************************/
/*******************************************************************************
**  TRACEABILITY: [cover parentID= DS_MCAL_SPI_9813_01,DS_MCAL_SPI_9810_01,
DS_MCAL_SPI_9818_01,DS_MCAL_SPI_9808_01,SAS_MCAL_SPI_9844, 
DS_NAS_HE2_SPI_PR2981_2,DS_NAS_EP_SPI_PR2981_2, ]
**  [/cover]                                                                  **
*******************************************************************************/

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/

#include "IfxQspi_reg.h"
#include "IfxDma_reg.h"
#include "IfxSrc_reg.h"
#include "IfxPort_reg.h"

/* Own header file, this includes own configuration file also */
#include "Spi_Local.h"

#if(SPI_SLAVE_ENABLE == STD_ON)
/* Inclusion from Diagnostic Error Manager File */
/* The module shall include the Dem.h file.*/
#if ( (SPI_HW_ERROR_DEM_REPORT == ENABLE_DEM_REPORT) ||  \
      (SPI_DMA_ERROR_DEM_REPORT == ENABLE_DEM_REPORT) )
#include "Dem.h"
#endif

/*
  Exports specific definitions and services of the BSW Scheduler for SPI
*/
#include "SchM_Spi.h"

/* Inclusion from Safety Error */
/* The module shall include the SafetyReport.h file.*/
/*AI00247913 Fixed*/
#if(SPI_SAFETY_ENABLE == STD_ON)
#include "SafetyReport.h"
#endif

/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/
/* Value to indicate that the SPI Bus is Idle */
#define SPI_BUS_IDLE ((uint8)0xFFU)

/* Value to indicate that the Sequence is non active */
#define SPI_SEQ_IDLE_ID (0xFFU)
/* Value to indicate that the Job is non active */
#define SPI_JOB_IDLE_ID (0xFFFFU)

/* Defines for QSPI GLOBALCON Register */
#define SPI_QSPI_SLAVE_SELECT (0x02U)
#define SPI_QSPI_LOOPBACK_DISABLE (0x0U)

#define SPISLAVE_QSPI_CLOCKPHASE     (0x01U)
#define SPISLAVE_QSPI_CLOCKPOL_SHIFT (0x00U)

/* SRC TOS values for DMA Move Engines */
#define SPI_SRCREG_TOS_DMA (3U)

/* Defines for Dem errors */
#define SPI_DEM_HW_ERROR (1U)
#define SPI_DEM_DMA_TRANSFER_ERROR (2U)

/* DMA Interrupt Category in Asyn Mode with Interrupts
  Interrupt trigger is generated and bit CHSRxz.ICH
  is set on changing the TCOUNT value and TCOUNT equals IRDV*/
#define SPI_DMA_INTCT         (2U)

/* DMA Channel Control Setting for 16 Bit data Width */
#define SPI_DMA_CHDW_16BIT    (0x1U )

/* DMA Channel Control Setting for 32 Bit data Width */
#define SPI_DMA_CHDW_32BIT    (0x2U )

/* DMA Channel Control Setting for 8 Bit data Width */
#define SPI_DMA_CHDW_8BIT    (0x0U)

/* DMA Interrupt Category in Asyn Mode with Interrupts
  Interrupt trigger is generated and bit CHSRxz.ICH
  is set on changing the TCOUNT value and TCOUNT equals IRDV*/
#define SPI_DMA_INTCT         (2U)

/* DMA RX Channel Address Control Reg Value :
   Dest Address  Increment : 1*CHDW
   Src  Address  Increment : 0
   CBLD = 0xF; INCD =1; SMF = DMF = 0 i.e 1*CHDW (i.e.CHCRxz.CHDW)
*/
#define SPI_DMA_RX_ADRCR_NORML_TRANSFER (0x08B0F080U)

/* Dma SRC register addresses */
/* #define SRC_DMACH0ADDR ((Ifx_SRC_SRCR_Bits volatile *)
                                                      (void *)&(SRC_DMA_CH0)) */

/* Macros for receive count shift. */
#define SPI_RECEIVECOUNT_SHIFT_16BIT (1U)
#define SPI_RECEIVECOUNT_SHIFT_32BIT (2U)
#define SPI_RECEIVECOUNT_ONE (1U)

/* Macros for receive completion status  */
#define SPI_RX_IN_PROGRESS (1U)
#define SPI_RX_COMPLETED (0U)

/* Defines for status register */
#define SPI_QSPI_ERRORSTATUS_MASK (0x079U)
/* Defines for FLAGSCLEAR register */
#define SPI_QSPI_FLAGSCLEAR_VALUE (0x0FFFU)
#define SPI_QSPI_RXC_FLAGSCLEAR_VALUE (0x00000400U)
#define SPI_QSPI_ERR_FLAGSCLEAR_VALUE (0x000001FFU)

