HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
/* Baudrate config parameter masks */
#define SPI_BAUDRATECONFIG_TQ_MASK (0x00FFU)
#define SPI_BAUDRATECONFIG_Q_MASK (0x003FU)
#define SPI_BAUDRATECONFIG_Q_SHIFT (8U)
#define SPI_BAUDRATECONFIG_A_MASK (0x0003U)
#define SPI_BAUDRATECONFIG_A_SHIFT (16U)
#define SPI_BAUDRATECONFIG_B_MASK (0x0003U)
#define SPI_BAUDRATECONFIG_B_SHIFT (18U)
#define SPI_BAUDRATECONFIG_C_MASK (0x0003U)
#define SPI_BAUDRATECONFIG_C_SHIFT (20U)

  /* HW channels vary from 0 - 15
     but the ECON maps 8 - 15 to 0 to 7.   */
#define SPI_CONFIG_HWCHANNELNO_MASK (0x0FU)
#define SPI_CONFIG_HWCHANNELNO_SHIFT (19U)
#define SPI_CONFIG_MSB_MASK (0x1U)
#define SPI_CONFIG_MSB_SHIFT (8U)
#define SPI_CONFIG_DATALENGTH_MASK (0x1FU)
#define SPI_CONFIG_TIMEDELAY_MASK (0x0007FFFFU)
#define SPI_SLAVE_TRANSMIT_DATA (0xf0f0e0e0U)

/* Defines for QSPI GLOBALCON1 Register */
/*
#define SPI_QSPI_ERRORENS_VALUE (0x17FU)*/
/* Transmitter FIFO errors are disabled as slave shall only receive data
 baud rate error shall be enabled for slave this detects baud rate error
 in shift clock input */
#define SPI_QSPI_ERRORENS_VALUE (0x1E7U)
/* If the TXFIFO filling level is equal or less than this
threshold, than each move of an element from the
TXFIFO to the shift register triggers a transmit interrupt */
#define SPI_QSPI_TXFIFOINT_VALUE (0x0U)
/* If the RXFIFO filling level is equal or greater than this
threshold, than each move of an element from the shift
register to the FIFO triggers a receive interrupt */
#define SPI_QSPI_RXFIFOINT_VALUE (0x0U)
/* Enable the Interrupt */
#define SPI_QSPI_INT_ENABLE (0x1U)
/* Disable the interrupt */
#define SPI_QSPI_INT_DISABLE (0x0U)

/* Defines for QSPI BACONENTRY Register */
#define SPI_QSPI_TIMEDELAY_MASK (0x0007FFFEU)
#define SPI_QSPI_DL_BIT_SELECT (0U)

/*Macro to handle 16 bit data */
#define SPI_16BIT_DATA_ACCESS  (2U)
/*Macro to handle 32 bit data */
#define SPI_32BIT_DATA_ACCESS  (4U)
/*Macro to handle 8 bit data */
#define SPI_8BIT_DATA_ACCESS  (1U)

#define SPI_HWUNIT_MASK (0x0FU)
#define SPI_HWUNIT_CH_SHIFT (0x04U)

/* Defines for QSPI GLOBALCON Register */
#define SPI_QSPI_MASTER_SELECT (0x0U)
#define SPI_QSPI_LOOPBACK_DISABLE (0x0U)
#define SPI_QSPI_EXPECT_VALUE (15U)
#define SPI_QSPI_SI_DISABLE (0U)
#define SPI_QSPI_SRF_DISABLE (0U)
#define SPI_QSPI_MODULE_ENABLE (1U)

#if(SPI_RESET_SFR_INIT == STD_ON)
#define SPI_KERNEL_RESET_VALUE  (0x00000001U)
#define SPI_KERNEL_RESET_STATUS (0x00000002U)
#define SPI_DMA_RESET_VALUE     (0x00000000U)
#endif

/* Defines for QSPI ECON Register */
#define SPI_QSPI_CLOCKPHASE_MASK (0x01U)
#define SPI_QSPI_CLOCKPOL_MASK (0x01U)
#define SPI_QSPI_CLOCKPOL_SHIFT (0x01U)

  /* HW channels vary from 0 - 15
     but the ECON maps 8 - 15 to 0 to 7.   */
#define SPI_QSPI_HWCHANNELNO_MASK (0x7U)

/* Mask for 16 Bit Data in the Channel's Data Configuration variable.
i.e to determine if data width > 8 */
#define SPI_16BIT_DATAMASK ((uint16)(0x0008U))
/* Mask for 32 Bit Data in the Channel's Data Configuration variable.
i.e to determine if data width > 16 */
#define SPI_32BIT_DATAMASK ((uint16)(0x0010U))

/* Define to reset the QSPI module by setting GLOBALCON.RESETS bits */
#define SPI_QSPI_RESET_MODULE (0xF0000000U)
/*Define reset value for GLOBALCON register   */
#define SLAVE_QSPI_GLOBCON_RSTVAL (0x040F30FFU)

#define SLAVE_QSPI_ECON_RSTVAL (0x00001450U)

#define SPI_QSPI_RST_STATEMCHNEANDFIFO (0x7U)

#define SPI_QSPI_CLC_DISR_DISABLE (0x00000001U)

/* SPI Register Start Address Mapping */
#define SPI_HW_MODULE  ((volatile Ifx_QSPI *)(void *) &(MODULE_QSPI0))

#define SPI_HWUNIT_MASK (0x0FU)
#define SPI_HWUNIT_CH_SHIFT (0x04U)

/* This macro is used to find the position of the sequence in the array
SeqStatus */
#define SPI_SEQUENCE_BIT_POSITION  ((uint8)15)
/* This macro to find the index for sequence in the array SeqStatus. */
#define SPI_SEQUENCE_INDEX   ((uint8)4)

/*
  This macro extracts the status of the seq from two bits
*/
#define SPI_SEQUENCE_STATUS_EXTRACT  (3U)
#define SPI_SEQUENCE_STATUS_BITMASK  (0x03U)

/* This macro to find the index for Job in the array Spi_JobResult. */
#define SPI_JOB_INDEX   ((uint8)4)
/*
  This macro represents the number of bits required to hold the staus of jobs
*/
#define SPI_JOB_STATUS_BITS  ((uint8)2U)
/*
  This macro extracts the status of the job from two bits
*/
#define SPI_JOB_STATUS_EXTRACT  (3U)

/*
  This macro represents the number of bits required to hold the staus of seq
*/
#define SPI_SEQUENCE_STATUS_BITS  (2U)
/*
This macro is used to find the position of the Job in the array Spi_JobResult
*/
#define SPI_JOB_BIT_POSITION  ((uint8)15)

#if ( SPI_INITCHECK_API == STD_ON )
/* Compare value of the init check */
#define SPI_INITCHK_COMP_VALUE  (0xFFFFFFFFU)
#endif
/* ( SPI_INITCHECK_API == STD_ON ) */

/*******************************************************************************
**                      Private Type Definitions                              **
*******************************************************************************/
/*
Type:Spi_SlaveEBBuffer.
The EB Buffer Parameters.
*/
typedef struct Spi_SlaveEBBuffer
{
  Spi_DataType* DestPtr;        /* Destination pointer */
  Spi_NumberOfDataType Length;  /* Number of the data to be transmitted */
}Spi_SlaveEBBufferType;

/*******************************************************************************
**                 Private Function Declarations:
*******************************************************************************/

/* This function configures the Slave hardware  for the reception of data */
static void Spi_lSlaveStartJob(uint32 Module, Spi_JobType JobId);

/*returns value 1, on finding the jobs shared by the sequences*/
static uint8 Spi_lSlaveSeqSharingJobStatus
(
  const Spi_SequenceConfigType* SeqConfigPtr
);

/* This function configures the QSPI and Dma hardware for
      the channel reception      */
static void Spi_lSlaveStartChannel(uint32 Module, Spi_ChannelType Channel,
       uint32 DelayAndHwChNo, uint8 ParityConfig);

/* Function to Enable Spi Slave Hw Rx Interrupt*/
IFX_LOCAL_INLINE void  Spi_lSlaveHwEnableQspiRxIntr(uint32 Module);

/* Function to Disable Spi Slave Hw Rx Interrupt */
IFX_LOCAL_INLINE void  Spi_lSlaveHwDisableQspiRxIntr(uint32 Module);

