HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
/* Function to Enable Spi Slave Hw Rx Interrupt */
IFX_LOCAL_INLINE void  Spi_lSlaveHwEnableQspiErrIntr(uint32 Module);

/* Function to Clear Dma Hw Rx channel Interrupt */
IFX_LOCAL_INLINE void  Spi_lSlaveHwDmaClearIntr(Dma_ChannelType Channel);

/*Disable the Module at the end of Job transmission */
IFX_INLINE void Spi_lSlaveHwDisableModule(uint32 Module);

/* Function to Start transfer of Dma Rx Channels */
IFX_LOCAL_INLINE void Spi_lSlaveHwDmaStartReception(
Spi_DataType* DmaRxDestPtr,
uint32 DmaReceiveCount,uint16 DataWidth);

/*This function returns the id of the completed job */
IFX_LOCAL_INLINE uint16 Spi_lSlaveCompletedJobId(void);

/*  Function to Initialise Spi Slave Hw Interrupts during
    Hw initialisation */
IFX_LOCAL_INLINE void  Spi_lSlaveHwInitIntr(uint32 Module);

/* Function to Initialise Dma Hw used for Spi Slave during
   Hw initialisation */
static void Spi_lSlaveHwDmaInit(void);

/* Function to Initialise Dma Hw Interrupts */
IFX_LOCAL_INLINE void  Spi_lSlaveHwInitDmaIntr(void);

/* Function to deinitialize DMA module */
static void Spi_lSlaveHwDmaDeInit(void);

/* The function shall configure the spi slave channel
   parameters in the hardware */
static void Spi_lSlaveHwSetChannelConfig(volatile uint32 Module,
                uint16 DataConfig,uint32 DelayAndHwChNo, uint8 ParityConfig);

/*  Function to Set Slave Job Configuration Parameters  */
static void Spi_lSlaveHwSetJobConfig(volatile Ifx_QSPI* ModulePtr,
                                  const Spi_JobConfigType* JobConfigPtr);

#if(SPI_BAUDRATE_AT_RUNTIME == STD_OFF)

IFX_LOCAL_INLINE void Spi_lSlaveHwSetConfigExtn
                                           (const Spi_ConfigType* ConfigPtr);

#if (SPI_INITCHECK_API == STD_ON)
IFX_LOCAL_INLINE Std_ReturnType Spi_lSlaveHwCheckConfigExtn
                                           (const Spi_ConfigType* ConfigPtr);
#endif

#endif /* SPI_BAUDRATE_AT_RUNTIME == STD_OFF */

/* Function to write into slave transmission buffer  */
IFX_LOCAL_INLINE void Spi_lSlaveWriteTransmit(void);

IFX_LOCAL_INLINE uint32 Spi_lChkEBBufCont(Spi_ChannelType Channel,
                uint16 EBDatCfg);

/* Function to clear Job Result status(SPI_JOB_OK) */
IFX_LOCAL_INLINE void Spi_lSlaveClearJobResultStatus(void);

/* Function to clear Sequence Status (SPI_SEQ_OK) */
IFX_LOCAL_INLINE void Spi_lSlaveClearSequenceStatus(void);

#if ((SPI_CANCEL_API == STD_ON) && (SPI_LEVEL_DELIVERED != 0U))
/*Clear Sequence Canceled State*/
IFX_LOCAL_INLINE void  Spi_lSlaveClrSeqCancelStatus(Spi_SequenceType Seq);

/* Function to set sequence cancel status */
IFX_LOCAL_INLINE void  Spi_lSlaveSetSeqCancelStatus(Spi_SequenceType Seq);
#endif

#if (SPI_CANCEL_API == STD_ON)
/* Function to set the status of sequence cancelled to cancel */
IFX_LOCAL_INLINE void Spi_lSlaveSeqCancelled(Spi_JobAndSeqAccessType \
                                                           *JobSeqDataPtr);
#endif
/*(SPI_CANCEL_API == STD_ON)*/

/*Returns the sequence status*/
IFX_LOCAL_INLINE Spi_SeqResultType Spi_lSlaveGetSeqStatus(Spi_SequenceType Seq);

/*Set the sequence status */
IFX_LOCAL_INLINE void Spi_lSlaveSetSeqStatus
(
Spi_SequenceType Seq,
Spi_SeqResultType Status
);

/*set the Sequence result atomically*/
IFX_LOCAL_INLINE void Spi_lSlaveSetSeqStatusAtomic(Spi_SequenceType Seq,
                              Spi_SeqResultType Status);

IFX_LOCAL_INLINE void Spi_lSlaveSetJobStatusAtomic
(
  Spi_JobType Job,
  Spi_JobResultType Result
);

#if ( SPI_INITCHECK_API == STD_ON )
static Std_ReturnType Spi_lSlaveHwDmaSfrInitCheck(void);
static Std_ReturnType Spi_lSlaveInitGlobalVarCheck(void);
#endif

/*******************************************************************************
**                      Global Constant Definitions                           **
*******************************************************************************/
/*******************************************************************************
**                      Global Variable Definitions                           **
*******************************************************************************/
/*******************************************************************************
**                      Private Constant Definitions                          **
*******************************************************************************/
/*******************************************************************************
**                      Private Variable Definitions                          **
*******************************************************************************/

/*
  used for global or static variables (8 bits) that are initialized
  after every reset
*/
#define SPI_START_SEC_ASIL1_VAR_8BIT

/*
  Allows to map variables, constants and code of modules to individual
  memory sections.
*/
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#define SPI_STOP_SEC_ASIL1_VAR_8BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*
 * To be used for all global or static variables (unspecified size )
 * that are never  initialized.
 */
#define SPI_START_SEC_ASIL1_VAR_UNSPECIFIED
/*
  Allows to map variables, constants and code of modules to individual
  memory sections.
*/
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

static Spi_JobAndSeqAccessType Spi_SlaveJobAndSeqAccess;

Spi_SlaveChnlAccessType Spi_SlaveChnlAccess[SPI_NUM_ASIL_SLAVE_MODULES];

/* EB Buffer Parameters are stored */
static Spi_SlaveEBBufferType Spi_SlaveEBBuffer[SPI_MAXIMUM_CHANNEL];
static volatile Spi_StatusType Spi_SlaveBusStatus;
static Spi_AsilSeqStatusType Spi_SlaveSeqStatus[SPI_SEQUENCE_ASIL_ARRAY_INDEX];

#define SPI_STOP_SEC_ASIL1_VAR_UNSPECIFIED
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

#define SPI_START_SEC_ASIL1_VAR_FAST_32BIT
/*
  Allows to map variables, constants and code of modules to individual
  memory sections.
*/
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/* Variable Holds the Configuration Pointer given in Spi_lSlaveInit */
static const Spi_ConfigType* Spi_kSlaveConfigPtr;

