HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
/* Variable to Hold Job Result. */
uint32 Spi_SlaveJobResult[SPI_JOB_ASIL_ARRAY_INDEX];

#define SPI_STOP_SEC_ASIL1_VAR_FAST_32BIT
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*******************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/
/*Memory Map of the SPI Code*/
#define SPI_START_SEC_CODE
/*
  Allows to map variables, constants and code of modules to individual
  memory sections.
*/
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
  allowed only for MemMap.h*/
#include "MemMap.h"

/*******************************************************************************
** Traceability :                                                             **
** Syntax : void Spi_lSlaveInit(const Spi_ConfigType* ConfigPtr)              **
** [/cover]                                                                   **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non reentrant                                                 **
**                                                                            **
** Parameters (in) :  ConfigPtr - Pointer to configuration set                **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value    :  None                                                    **
**                                                                            **
** Description :Initialization Service for SPI SLAVE .                        **
** The Initialization service initializes all SPI SLAVE relevant              **
** registers and global variables with the values of the structure            **
** referenced by the parameter ConfigPtr.                                     **
*******************************************************************************/
void Spi_lSlaveInit(const Spi_ConfigType* ConfigPtr)
{
  uint32 Index;
  #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)
  uint32 JobReIndex;
  #endif
  uint32 ReadBack;
  Spi_SlaveEBBufferType* EBBufferPtr;
  const Spi_HWModuleConfigType* HWModuleConfigPtr;
  Ifx_QSPI_GLOBALCON GlobalConReg;
  Ifx_QSPI* ModulePtr;
  #if(SPI_RESET_SFR_INIT == STD_ON)
  uint32 LoopCounter;
  #endif

  /*  ------------------------------------------------------------------ **
  **                 SPI Slave Channel Initialization                    **
  **  ------------------------------------------------------------------ */

  Index = (uint32)(ConfigPtr->NoOfChannels) - (uint32)(Spi_NoOfIBChannels);
  do
  {
    Index--;
    /* Get Slave EB_Buffer Pointer */
    EBBufferPtr = &(Spi_SlaveEBBuffer[Index]);
    EBBufferPtr->DestPtr = NULL_PTR;   /* Set EB Destination Pointer to NULL*/
    EBBufferPtr->Length  = (Spi_NumberOfDataType)0U;/* Set EB Length to 0 */
  }while (Index > 0U);

  /*  ------------------------------------------------------------------ **
  **                 Global Variable Initialization                      **
  **  ------------------------------------------------------------------ */

  Spi_kSlaveConfigPtr = ConfigPtr;  /* Store ConfigPtr for use by APIs*/
  Spi_SlaveBusStatus = SPI_IDLE; /* Set SPI Slave Bus Status to Idle */

  /* Rx Dma Channel no's are copied to Global variable from Configuration*/
  Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel =
                         ConfigPtr->HWModuleConfigPtr[SPI_SLAVE_MODULE_INDEX]->\
                         SpiDmaConfigPtr->RxDmaChannel;
  #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)
  Index = ConfigPtr->NoOfSequences; /* Set Index to the last Sequence */
  do
  {
    Index--;
    /* Set each Sequence Status to SPI_SEQ_OK */
    Spi_SlaveJobAndSeqAccess.CurrentJobIndex[Index] = 0U;
  }while (Index > 0U);

  for(JobReIndex = 0U; JobReIndex < SPI_MAX_JOB_TRIG_Q_LENGTH; JobReIndex++)
  {
    Spi_SlaveJobAndSeqAccess.JobQueueRearrange[JobReIndex]          = 0U;
    Spi_SlaveJobAndSeqAccess.JobLinkedSequenceRearrange[JobReIndex] = 0U;
  }
  #else
  Spi_SlaveJobAndSeqAccess.CurrentJobIndex = 0U;
  #endif

  Spi_SlaveJobAndSeqAccess.StartIndexExtractJobId = (Spi_JobType)0U;

  Spi_SlaveJobAndSeqAccess.EndIndex = (Spi_JobType)0U;

  /* Set Sequence Status to not active in the Sequence Queue */
  Index = 0U;
  do
  {
    Spi_SlaveJobAndSeqAccess.JobLinkedSeq[Index] = SPI_SEQ_IDLE_ID;
    Spi_SlaveJobAndSeqAccess.JobQueue[Index] = SPI_JOB_IDLE_ID;
    Index++;
  }while (Index < SPI_MAX_JOB_TRIG_Q_LENGTH);

  /* Job Result status to SPI_JOB_OK */
  Spi_lSlaveClearJobResultStatus();
  /* Sequence status to SPI_SEQ_OK */
  Spi_lSlaveClearSequenceStatus();

  /*  ------------------------------------------------------------------ **
  **                 SPI Slave HW Module and Dma initilisation           **
  **  ------------------------------------------------------------------ */

  /* Enter Critical Section */
  SchM_Enter_Spi_Init();

  /* Reset End Init Protection to access regsiters */
  Mcal_ResetENDINIT();

  /* Get QSPIx Configuration Pointer */
  HWModuleConfigPtr = (ConfigPtr->HWModuleConfigPtr[SPI_SLAVE_MODULE_INDEX]) ;
  /* SPI QSPIx Module Initialisation within end init protection */
  /* Initialize CLC Register - Enable QSPIx Module, Set Sleep Settings */
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].CLC.U = \
                                    HWModuleConfigPtr->HWClkSetting;
  /* Fix for CPU Bug CPU_TC.H002 */
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ReadBack = (uint32)SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].CLC.U;
  UNUSED_PARAMETER(ReadBack)

