HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
#if(SPI_RESET_SFR_INIT == STD_ON)
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].KRST0.U = SPI_KERNEL_RESET_VALUE;

  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ReadBack = SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].KRST0.U;
  UNUSED_PARAMETER(ReadBack)
  
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].KRST1.U = SPI_KERNEL_RESET_VALUE;

  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ReadBack = SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].KRST1.U;
  UNUSED_PARAMETER(ReadBack)
  
  LoopCounter = SPI_KERNEL_RESET_WAIT_COUNT;
  
  do
  {
    LoopCounter--;
    #if (IFX_SPI_DEBUG_RST == STD_ON)
    ReadBack = Spi_IfxDebugStatus;
    #else
    /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to
      cast away volatile in terms of pointer access.*/
    /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic 
      is used to efficiently access the SFRs of multiple QSPI Modules.*/
    ReadBack = SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].KRST0.U;
    #endif
  }while((ReadBack != SPI_KERNEL_RESET_STATUS) && (LoopCounter > 0U));

  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to 
    cast away volatile in terms of pointer access.*/
/*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].KRSTCLR.U = SPI_KERNEL_RESET_VALUE;
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to
    cast away volatile in terms of pointer access.*/
/*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ReadBack = SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].KRSTCLR.U;
  
#endif /* SPI_RESET_SFR_INIT == STD_ON */
  
  UNUSED_PARAMETER(ReadBack)
  
  /* Set End Init Protection */
  Mcal_SetENDINIT();

  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].GLOBALCON.U = SPI_QSPI_RESET_MODULE;

  /* Select Lines (A/B) for MOSI */
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].PISEL.U = \
                                  (((uint32)SPI_SLAVE_SRIS_SEL << 4U) | \
                                   ((uint32)SPI_SLAVE_SCIS_SEL << 8U));

#if(SPI_BAUDRATE_AT_RUNTIME == STD_OFF)
  /*Set the ECON register values */
  Spi_lSlaveHwSetConfigExtn(ConfigPtr);
#endif /* SPI_BAUDRATE_AT_RUNTIME == STD_OFF */

  Spi_lSlaveHwInitIntr(SPI_SLAVE_MODULE_INDEX);

  Spi_lSlaveHwDmaInit();

  /*  ------------------------------------------------------------------ **
  **              Enable QSPI as SLAVE                                   **
  **  ------------------------------------------------------------------ */

  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ModulePtr =  &(SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX]);

  GlobalConReg.U = ModulePtr->GLOBALCON.U;

  GlobalConReg.B.MS = SPI_QSPI_SLAVE_SELECT;

  ModulePtr->GLOBALCON.U = GlobalConReg.U;

  /* Exit Critical Section */
  SchM_Exit_Spi_Init();

}
/*******************************************************************************
** Syntax : void Spi_lSlaveDeInit (void)                                      **
** [/cover]                                                                   **
**                                                                            **
** Service ID:  1                                                             **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non reentrant                                                 **
**                                                                            **
** Parameters (in) : None                                                     **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : None                                                     **
**                                                                            **
** Description : Service For SPI SLAVE Deinitialization                       **
**                                                                            **
*******************************************************************************/
void Spi_lSlaveDeInit(void)
{
  #if ((SPI_LEVEL_DELIVERED == 1U) || (SPI_LEVEL_DELIVERED == 2U))
  uint32 Index;
  #endif
  volatile uint32 ReadBack;

