HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
  Ifx_QSPI* ModulePtr;
  uint8 HwChnlIdx;

  /*  ------------------------------------------------------------------ **
  **                 Global Variable Initialization                      **
  **  ------------------------------------------------------------------ */

  Spi_SlaveBusStatus = SPI_IDLE; /* Set SPI Slave Bus Status to Idle */

  #if ((SPI_LEVEL_DELIVERED == 1U) || (SPI_LEVEL_DELIVERED == 2U))

  #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)
  /* Set Index to the last Sequence */
  Index = Spi_kSlaveConfigPtr->NoOfSequences;
  do
  {
    Index--;
    /* Set each Sequence Status to SPI_SEQ_OK */
    Spi_SlaveJobAndSeqAccess.CurrentJobIndex[Index] = 0U;
  }while (Index > 0U);
  #else
  Spi_SlaveJobAndSeqAccess.CurrentJobIndex = 0U;
  #endif

  Spi_SlaveJobAndSeqAccess.StartIndexExtractJobId = (Spi_JobType)0U;

  Spi_SlaveJobAndSeqAccess.EndIndex = (Spi_JobType)0U;

  /* Set Sequence Status to not active in the Sequence Queue */
  Index = 0U;
  do
  {
    Spi_SlaveJobAndSeqAccess.JobLinkedSeq[Index] = SPI_SEQ_IDLE_ID;
    Spi_SlaveJobAndSeqAccess.JobQueue[Index] = SPI_JOB_IDLE_ID;
    Index++;
  }while (Index < SPI_MAX_JOB_TRIG_Q_LENGTH);

  #endif

  /* Reset Global Config Pointer */
  Spi_kSlaveConfigPtr = NULL_PTR;

  /*  ------------------------------------------------------------------ **
  **                 SPI Slave HW Module and Dma DeInitilisation         **
  **  ------------------------------------------------------------------ */

  /* Enter Critical Section */
  SchM_Enter_Spi_Init();

  /* Reset End Init Protection to access regsiters */
  Mcal_ResetENDINIT();

  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].GLOBALCON.U = SPI_QSPI_RESET_MODULE;

  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away
    volatile in terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used
    to efficiently access the SFRs of multiple QSPI Modules.*/
  ModulePtr =  &(SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX]);
  for(HwChnlIdx = 0U; HwChnlIdx < 8U; HwChnlIdx++)
  {
    ModulePtr->ECON[HwChnlIdx].U = SLAVE_QSPI_ECON_RSTVAL;
  }

  /* Set DISR to Disable the Module */
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].CLC.U = \
                                  SPI_QSPI_CLC_DISR_DISABLE;

  /* Fix for CPU Bug CPU_TC.H002 */
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ReadBack = (uint32)SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].CLC.U;
  UNUSED_PARAMETER(ReadBack)

  /* Set End Init Protection */
  Mcal_SetENDINIT();

  MODULE_SRC.QSPI.QSPI[SPI_SLAVE_MODULE_INDEX].RX.B.CLRR   = 1U;
  /*  Disable intr */
  MODULE_SRC.QSPI.QSPI[SPI_SLAVE_MODULE_INDEX].RX.B.SRE  = 0U;

  Spi_lSlaveHwDmaDeInit();

  Spi_SlaveChnlAccess[0].DmaChannelIdx.RxDmaChannel = DMA_CHANNEL_INVALID;

  /* Exit Critical Section */
  SchM_Exit_Spi_Init();
} /* End of Function: Spi_DeInit */

/*******************************************************************************
** Syntax : IFX_LOCAL_INLINE void Spi_lSlaveClearJobResultStatus(void)        **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Re-entrant                                                    **
**                                                                            **
** Parameters (in) : None.                                                    **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : void                                                     **
**                                                                            **
** Description : Function to Set Job Result status to SPI_JOB_OK.             **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveClearJobResultStatus(void)
{
  uint16 Index;
  Index = 0U;

  #if (SPI_JOB_ASIL_ARRAY_INDEX > 1U)
  do
  {
  #endif
    Spi_SlaveJobResult[Index] = 0U; /*Set Job Result status to SPI_JOB_OK */
    #if (SPI_JOB_ASIL_ARRAY_INDEX > 1U)
        Index++;
  }while (Index < SPI_JOB_ASIL_ARRAY_INDEX);
    #endif

}
#if ((SPI_CANCEL_API == STD_ON) && (SPI_LEVEL_DELIVERED != 0U))
/*******************************************************************************
** Syntax           :  IFX_LOCAL_INLINE void Spi_lSlaveClrSeqCancelStatus     **
** (                                                                          **
**   Spi_SequenceType Seq                                                     **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Non-Reentrant                                           **
**                                                                            **
** Parameters (in)  : Seq - Sequence Id                                       **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Clear Sequence Canceled State                           **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveClrSeqCancelStatus(Spi_SequenceType Seq)
{
  uint16 Index;

  /* ASIL or QM sequence index from map configuration*/
  Index = (uint16)((uint16)Spi_kSlaveConfigPtr->SpiMapConfigPtr->SeqIndex[Seq]
            >> SPI_SEQUENCE_INDEX);

  Spi_SlaveSeqStatus[Index].AsilSeqCancelStatus =
        Spi_SlaveSeqStatus[Index].AsilSeqCancelStatus & \
        (~((uint32)SPI_SEQ_CANCELED << (SPI_SEQUENCE_STATUS_BITS * \
        (Seq & SPI_SEQUENCE_BIT_POSITION))));

