HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
}
#endif
/*******************************************************************************
** Syntax : IFX_LOCAL_INLINE void Spi_lSlaveClearSequenceStatus(void)         **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Re-entrant                                                    **
**                                                                            **
** Parameters (in) : None.                                                    **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : void                                                     **
**                                                                            **
** Description : Function to Set Job Result status to SPI_SEQ_OK.             **
**                                                                            **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveClearSequenceStatus(void)
{
  uint32 IndexValue;
  IndexValue = 0U;

  #if (SPI_SEQUENCE_ASIL_ARRAY_INDEX > 1U)
  do
  {
  #endif
    /* Set Sequence Status SPI_SEQ_OK */
    Spi_SlaveSeqStatus[IndexValue].AsilSeqStatus = 0U;
    #if ((SPI_CANCEL_API == STD_ON) && (SPI_LEVEL_DELIVERED != 0U))
    /* Clear the Status Variable */
    Spi_SlaveSeqStatus[IndexValue].AsilSeqCancelStatus = 0U;
    #endif
    /* ((SPI_CANCEL_API == STD_ON) && (SPI_LEVEL_DELIVERED != 0)) */
    #if (SPI_SEQUENCE_ASIL_ARRAY_INDEX > 1U)
    IndexValue++;
  }while (IndexValue < SPI_SEQUENCE_ASIL_ARRAY_INDEX);
  #endif
}
/*******************************************************************************
** Syntax           :  IFX_LOCAL_INLINE void Spi_lSlaveSetSeqStatus           **
** (                                                                          **
**   Spi_SequenceType Seq, Spi_SeqResultType Status                           **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Non-Reentrant                                           **
**                                                                            **
** Parameters (in)  : Seq - Seq Id                                            **
**                Status - Sequence status                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Set the sequence status                                 **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveSetSeqStatus
(
Spi_SequenceType Seq,
Spi_SeqResultType Status
)
{
  uint8 Index;

  /* ASIL or QM sequence index from map configuration*/
  Index = (uint8)(Spi_kSlaveConfigPtr->SpiMapConfigPtr->SeqIndex[Seq]
            >> SPI_SEQUENCE_INDEX);

  Spi_SlaveSeqStatus[Index].AsilSeqStatus =     \
         (Spi_SlaveSeqStatus[Index].AsilSeqStatus & \
          ~((uint32)SPI_SEQUENCE_STATUS_EXTRACT <<
            (SPI_SEQUENCE_STATUS_BITS * ((Seq) & SPI_SEQUENCE_BIT_POSITION)))) |
           ((uint32)((uint32)Status & SPI_SEQUENCE_STATUS_BITMASK) <<
            (SPI_SEQUENCE_STATUS_BITS * ((Seq) & SPI_SEQUENCE_BIT_POSITION)));

}
/*******************************************************************************
** Syntax          : IFX_LOCAL_INLINE Spi_SeqResultType Spi_lSlaveGetSeqStatus**
** (                                                                          **
**   Spi_SequenceType Seq                                                     **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Seq - Seq Id                                            **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : sequence result.                                        **
**                                                                            **
** Description      : Returns the sequence status                             **
*******************************************************************************/
IFX_LOCAL_INLINE Spi_SeqResultType Spi_lSlaveGetSeqStatus(Spi_SequenceType Seq)
{
  Spi_SeqResultType RetVal = SPI_SEQ_OK;
  uint8 Index;

  /* ASIL or QM sequence index from map configuration*/
  Index = (uint8)(Spi_kSlaveConfigPtr->SpiMapConfigPtr->SeqIndex[Seq]
            >> SPI_SEQUENCE_INDEX);

