HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
  RetVal = (Spi_SeqResultType)((Spi_SlaveSeqStatus[Index].AsilSeqStatus >> \
    (SPI_SEQUENCE_STATUS_BITS * ((uint32)Seq &  SPI_SEQUENCE_BIT_POSITION))) \
        & SPI_SEQUENCE_STATUS_EXTRACT);

   return(RetVal);
}

/*******************************************************************************
** Syntax           :  IFX_LOCAL_INLINE void Spi_lSlaveSetSeqStatusAtomic     **
** (                                                                          **
**   Spi_SequenceType Seq, Spi_SeqResultType Status                           **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Seq - Sequence Id                                       **
**                Result - Sequence result                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : sequence result.                                        **
**                                                                            **
** Description      : set the Sequence result atomically                      **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveSetSeqStatusAtomic(Spi_SequenceType Seq,
                              Spi_SeqResultType Status)
{
  uint16 Index;
  uint32 Temp;
  sint32 *Ptr;

  Index = (uint16)((uint16)Spi_kSlaveConfigPtr->SpiMapConfigPtr->SeqIndex[Seq]
            >> SPI_SEQUENCE_INDEX);
  Ptr = (sint32*)(void*) &Spi_SlaveSeqStatus[Index].AsilSeqStatus;
  Temp = ((uint32)SPI_SEQUENCE_STATUS_BITS *
                   (uint32)((uint32)(Seq) & (uint32)SPI_SEQUENCE_BIT_POSITION));
  Mcal_SetAtomic(
       Ptr,
       (uint32)(Status),
       (sint32)Temp,
       2);
}

/*******************************************************************************
** Syntax           :  IFX_LOCAL_INLINE void Spi_lSlaveSetJobStatusAtomic     **
** (                                                                          **
**   Spi_JobType Job, Spi_JobResultType Result                                **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Job - Job Id                                            **
**                Result - job result                                         **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : sequence result.                                        **
**                                                                            **
** Description      : set the Job result atomically                           **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveSetJobStatusAtomic
(
  Spi_JobType Job,
  Spi_JobResultType Result
)
{
  uint16 Index;
  uint32 Temp;
  sint32 *Ptr;

  /* ASIL or QM Job index from map configuration*/
  Index = (uint16)(Spi_kSlaveConfigPtr->SpiMapConfigPtr->JobIndex[Job]
            >> SPI_JOB_INDEX);

  Ptr = (sint32*)(void*) &Spi_SlaveJobResult[Index];
  Temp = ((uint32)SPI_JOB_STATUS_BITS *
                        (uint32)((uint32)(Job) & (uint32)SPI_JOB_BIT_POSITION));

  Mcal_SetAtomic(
           Ptr,\
           (uint32)(Result),\
           (sint32)Temp,\
           2);
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE void Spi_lSlaveHwInitIntr              **
** (                                                                          **
**   uint32 Module                                                            **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : synchronous                                             **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Module - Hw module no.                                  **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to Initialise Spi Slave Hw Interrupts during   **
**                    Hw initialisation                                       **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveHwInitIntr(uint32 Module)
{
  MODULE_SRC.QSPI.QSPI[Module].RX.B.CLRR   = 1U;
  MODULE_SRC.QSPI.QSPI[Module].RX.B.SWSCLR = 1U;
  MODULE_SRC.QSPI.QSPI[Module].RX.B.IOVCLR = 1U;

  /* TOS is One bit in EP and 2 Bits in HE. delta managed using bitwise OR */
  MODULE_SRC.QSPI.QSPI[Module].RX.B.TOS = MODULE_SRC.QSPI.QSPI[Module].RX.B.TOS
                                                          | SPI_SRCREG_TOS_DMA;
  MODULE_SRC.QSPI.QSPI[Module].RX.B.SRPN = \
                      (uint8)Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel;

  MODULE_SRC.QSPI.QSPI[Module].RX.B.SRE  = 0U; /*  Enable intr */

