HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
}

/*******************************************************************************
** Syntax           : static void Spi_lSlaveHwDmaInit                         **
** (                                                                          **
**   void                                                                     **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : None.                                                   **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to Initialise Dma Hw used for Spi Slave during **
**                    Hw initialisation                                       **
*******************************************************************************/
static void Spi_lSlaveHwDmaInit(void)
{
  Dma_ChannelType DmaChannel;
  uint32 Address;

  DmaChannel = Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel;
  
#if(SPI_RESET_SFR_INIT == STD_ON)
  /* Reset for Slave Rx Dma channel */
  MODULE_DMA.ERRINTR.U = SPI_DMA_RESET_VALUE;
  MODULE_DMA.CH[DmaChannel].ADICR.U = SPI_DMA_RESET_VALUE;
  MODULE_DMA.CH[DmaChannel].CHCSR.U = SPI_DMA_RESET_VALUE;
  MODULE_DMA.TSR[DmaChannel].U = SPI_DMA_RESET_VALUE;
  MODULE_DMA.CH[DmaChannel].SADR.U = SPI_DMA_RESET_VALUE;
  MODULE_DMA.CH[DmaChannel].CHCFGR.U = SPI_DMA_RESET_VALUE;
  MODULE_DMA.CH[DmaChannel].DADR.U = SPI_DMA_RESET_VALUE;
#endif /* Reset at Init ON */ 

  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  Address = ((uint32)&(SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].RXEXIT.U));

  /* Enable Dma Interrupt */
  Mcal_DmaCfgMeErrIntr(1U);

  /* Set Source Address */
  Mcal_DmaSetSourceAddr(DmaChannel, Address);

  /* Init channel control register */
  Mcal_DmaChClrCtlCfg(Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel);

  Mcal_DmaChClrIntrFlags(Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel);

  /* DMA Error Initialization */
  Mcal_DmaEnTransReqLostIntr(Spi_SlaveChnlAccess[0U].DmaChannelIdx. \
                                                          RxDmaChannel);

  /* Set Interrupt Control  */
  Mcal_DmaCfgIntControl(Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel,
                            SPI_DMA_INTCT);

  /* Enable RX DMA Ch Interrupt Only */
  Mcal_DmaEnableChIntrTrigger(Spi_SlaveChnlAccess[0U].\
                                                    DmaChannelIdx.RxDmaChannel);

  Spi_lSlaveHwInitDmaIntr();
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE void Spi_lSlaveHwInitDmaIntr           **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : None                                                    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to Initialise Dma Hw Interrupts                **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveHwInitDmaIntr(void)
{
  Ifx_SRC_SRCR_Bits IntrSrc;
  uint32 RxChannelOffset;
  volatile Ifx_SRC_SRCR_Bits *MoveEngCh0BaseAddr;

  RxChannelOffset = (uint32)Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel;
  MoveEngCh0BaseAddr = SRC_DMACH0ADDR;

  /*IFX_MISRA_RULE_11_05_STATUS="MoveEngCh0BaseAddr" attempt to cast away
    volatile in terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="MoveEngCh0BaseAddr" Pointer arithmetic is used
    to efficiently access the SFRs of multiple QSPI Modules.*/
  IntrSrc = *((volatile Ifx_SRC_SRCR_Bits *)(void *)MoveEngCh0BaseAddr +
                                      RxChannelOffset);
  IntrSrc.CLRR = 1U;
  IntrSrc.SWSCLR = 1U;
  IntrSrc.IOVCLR = 1U;
  IntrSrc.SRE = 1U;    /* Enable intr */

  /*IFX_MISRA_RULE_11_05_STATUS="MoveEngCh0BaseAddr" attempt to cast away
    volatile in terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="MoveEngCh0BaseAddr" Pointer arithmetic is used
    to efficiently access the SFRs of multiple QSPI Modules.*/
  *((volatile Ifx_SRC_SRCR_Bits *)(void *)MoveEngCh0BaseAddr +
                          RxChannelOffset) = IntrSrc;
}
/*******************************************************************************
** Syntax           : static void Spi_lSlaveHwDmaDeInit                       **
** (                                                                          **
**   void                                                                     **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : None.                                                   **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to DeInitialise Dma Hw used for Spi            **
**                     Slave                                                  **
**                                                                            **
*******************************************************************************/
static void Spi_lSlaveHwDmaDeInit(void)
{
  Dma_ChannelType DmaChannel_rx = DMA_CHANNEL_INVALID;
  Ifx_SRC_SRCR_Bits IntrSrc;
  uint32 RxChannelOffset;
  volatile Ifx_SRC_SRCR_Bits *MoveEngCh0BaseAddr;

  DmaChannel_rx = Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel;

