HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
  Mcal_DmaChClrCtlCfg(DmaChannel_rx);
  Mcal_DmaSetSourceAddr(DmaChannel_rx,0U);
  Mcal_DmaSetDestAddr(DmaChannel_rx,0U);
  Mcal_DmaClrAdcr(DmaChannel_rx);

  Mcal_DmaChClrIntctEtrlFlags(DmaChannel_rx);
  Mcal_DmaDisableChIntrTrigger(DmaChannel_rx);
  Mcal_DmaChClrIntrFlags(DmaChannel_rx);

  /* Clear DMA Error Status Reg for Transaction Lost Error */
  Mcal_DmaClrErrFlags(DmaChannel_rx);

  RxChannelOffset = (uint32)Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel;
  MoveEngCh0BaseAddr = SRC_DMACH0ADDR;

  /*IFX_MISRA_RULE_11_05_STATUS="MoveEngCh0BaseAddr" attempt to cast away
    volatile in terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="MoveEngCh0BaseAddr" Pointer arithmetic is used
    to efficiently access the SFRs of multiple QSPI Modules.*/
  IntrSrc = *((volatile Ifx_SRC_SRCR_Bits *)(void *)MoveEngCh0BaseAddr +
                                      RxChannelOffset);
  IntrSrc.CLRR = 1U;
  IntrSrc.SRE = 0U;    /* Enable intr */

  /*IFX_MISRA_RULE_11_05_STATUS="MoveEngCh0BaseAddr" attempt to cast away
    volatile in terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="MoveEngCh0BaseAddr" Pointer arithmetic is used
    to efficiently access the SFRs of multiple QSPI Modules.*/
  *((volatile Ifx_SRC_SRCR_Bits *)(void *)MoveEngCh0BaseAddr +
                          RxChannelOffset) = IntrSrc;

}

/*******************************************************************************
** Syntax : Std_ReturnType Spi_SlaveSetupEB                                   **
** (                                                                          **
**   Spi_ChannelType Channel,                                                 **
**   Spi_DataType* DesDataBufferPtr,                                          **
**   Spi_NumberOfDataType DataLength                                          **
** )                                                                          **
** [/cover]                                                                   **
** Service ID:  0x11                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Re-entrant                                                    **
**                                                                            **
** Parameters (in) : Channel - Slave Channel ID.                              **
**                   DesDataBufferPtr - Pointer to Destination data           **
**                   buffer to store recieved data from SPI Master            **
**                   DataLength - Length of the data to be recieved           **
**                   on this channel                                          **
**                   Min.: 1                                                  **
**                   Max.: Max of data specified at configuration for         **
**                   this channel                                             **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : E_OK - Setup command has been accepted.                  **
**                   E_NOT_OK - Setup command has not been accepted.          **
**                                                                            **
** Description : Service to setup the buffers and the length of data          **
** for the External Buffer of SPI SLAVE Channel.                              **
** This service shall update the buffer pointers and lengh attributes         **
*******************************************************************************/
Std_ReturnType Spi_SlaveSetupEB
(
  Spi_ChannelType Channel,
  Spi_DataType* DesDataBufferPtr,
  Spi_NumberOfDataType DataLength
)
{

  uint32 RetVal;
  Spi_SlaveEBBufferType* EBBufferPtr;
  uint16 DataConfig;
  uint32 ReceiveCount;
  uint16 BufferLength;

  RetVal = E_OK;
  DataConfig = 0U;

  if ((Channel >= Spi_kSlaveConfigPtr->NoOfChannels) ||
     (Channel < (Spi_ChannelType)Spi_NoOfIBChannels))
  {
     /* Report to Safety error */
    SafeMcal_ReportError((uint16)SPI_MODULE_ID,SPI_INSTANCE_ID,
                    SPI_SLAVE_SID_SETUPEB,SPI_E_PARAM_CHANNEL);

    RetVal = E_NOT_OK;
  }
  else
  {
    /*IFX_MISRA_RULE_17_04_STATUS="SpiChannelConfigPtr" Pointer arithmetic used
      due to PBConfigStructure and is within allowed range.*/
    DataConfig = Spi_kSlaveConfigPtr->SpiChannelConfigPtr[Channel].DataConfig;

    ReceiveCount = Spi_lChkEBBufCont(Channel,DataConfig);

    if ((DataLength > ReceiveCount)
         ||(DataLength < (Spi_NumberOfDataType)1U))
    {
      /* Report to Safety error */
      SafeMcal_ReportError((uint16)SPI_MODULE_ID,SPI_INSTANCE_ID,
                       SPI_SLAVE_SID_SETUPEB,SPI_E_PARAM_LENGTH);
      RetVal = E_NOT_OK;
    }
  }

  if (RetVal == E_OK)
  {
    if (DataConfig & SPI_32BIT_DATAMASK)
    {
      /* Length/4U */
      BufferLength = (Spi_NumberOfDataType)(
                                    DataLength << SPI_RECEIVECOUNT_SHIFT_32BIT);
    }
    else if (DataConfig & SPI_16BIT_DATAMASK)
    {
      /* Length/2U */
      BufferLength = (Spi_NumberOfDataType)(
                                    DataLength << SPI_RECEIVECOUNT_SHIFT_16BIT);
    }
    else
    {
      BufferLength = DataLength;
    }

    /*IFX_MISRA_RULE_17_04_STATUS="DesDataBufferPtr" Pointer arithmetic used due
      to BufferStructure and is within allowed range.*/
    /*IFX_MISRA_RULE_17_04_STATUS="SpiChannelConfigPtr" Pointer arithmetic used
      due to PBConfigStructure and is within allowed range.*/
    if((DesDataBufferPtr == NULL_PTR)
         || (DesDataBufferPtr[BufferLength] !=
         Spi_kSlaveConfigPtr->SpiChannelConfigPtr[Channel].ChnlBufferMarker))
    {

      /* Report to Safety error */
      SafeMcal_ReportError((uint16)SPI_MODULE_ID,SPI_INSTANCE_ID,
                 SPI_SLAVE_SID_SETUPEB,SPI_E_PARAM_DEST_POINTER);

