HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
      RetVal = E_NOT_OK;
    }
  }

  if (RetVal == E_OK)
  {
    /* Get Slave EB Buffer Pointer */
    EBBufferPtr = &(Spi_SlaveEBBuffer[Channel]);

    EBBufferPtr->DestPtr = DesDataBufferPtr;

    if (DataConfig & SPI_32BIT_DATAMASK)
    {
      /* Length/4U */
      DataLength = (Spi_NumberOfDataType)(
                                    DataLength << SPI_RECEIVECOUNT_SHIFT_32BIT);
    }
    else if (DataConfig & SPI_16BIT_DATAMASK)
    {
      /* Length/2U */
      DataLength = (Spi_NumberOfDataType)(
                                    DataLength << SPI_RECEIVECOUNT_SHIFT_16BIT);
    }
    else
    {
      /*Do Nothing*/
    }

    EBBufferPtr->Length  = DataLength;

  }
  return ((Std_ReturnType)RetVal);

} /* End of Function: SpiSlave_SetUpEB */

/*******************************************************************************
** Syntax : IFX_LOCAL_INLINE uint32 Spi_lChkEBBufCont                         **
** (                                                                          **
**   Spi_ChannelType Channel,                                                 **
**   uint16 EBDatCfg                                                          **
** )                                                                          **
** [/cover]                                                                   **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Re-entrant                                                    **
**                                                                            **
** Parameters (in) : Channel - Slave Channel ID.                              **
**                   EBDatCfg -datawidth                                      **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : Count                                                    **
**                                                                            **
**                                                                            **
** Description : Service return count of buffer                               **
*******************************************************************************/
IFX_LOCAL_INLINE uint32 Spi_lChkEBBufCont(Spi_ChannelType Channel,
                                         uint16 EBDatCfg)
{

  uint32 Count;

  /* Data Width > 16 bits */
  if (EBDatCfg   & SPI_32BIT_DATAMASK)
  {
    /* Length/4U */
    /*IFX_MISRA_RULE_17_04_STATUS="SpiChannelConfigPtr" Pointer arithmetic used
      due to PBConfigStructure and is within allowed range.*/
    Count =
      ((uint32)Spi_kSlaveConfigPtr->SpiChannelConfigPtr[Channel].NoOfBuffers >>
                                SPI_RECEIVECOUNT_SHIFT_32BIT);
  }
  else if (EBDatCfg & SPI_16BIT_DATAMASK)
  {
    /* Length/2U */
    /*IFX_MISRA_RULE_17_04_STATUS="SpiChannelConfigPtr" Pointer arithmetic used
      due to PBConfigStructure and is within allowed range.*/
    Count =
      ((uint32)Spi_kSlaveConfigPtr->SpiChannelConfigPtr[Channel].NoOfBuffers >>
                                    SPI_RECEIVECOUNT_SHIFT_16BIT);
  }
  else
  {
    /*IFX_MISRA_RULE_17_04_STATUS="SpiChannelConfigPtr" Pointer arithmetic used
      due to PBConfigStructure and is within allowed range.*/
    Count = (uint32)Spi_kSlaveConfigPtr->SpiChannelConfigPtr[Channel].\
                                                                    NoOfBuffers;
  }

  return(Count);

}

/*******************************************************************************
** Syntax : void Spi_lSlaveWriteTransmit (void)                               **
                                                                              **
** [/cover]                                                                   **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Re-entrant                                                    **
**                                                                            **
** Parameters (in) :  void                                                    **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : void                                                     **
**                                                                            **
**                                                                            **
** Description : Service to write into slave transmit buffer                  **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveWriteTransmit(void)
{
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].DATAENTRY[0U].U = \
                                             SPI_SLAVE_TRANSMIT_DATA;

}

/*******************************************************************************
** Syntax : Std_ReturnType Spi_SlaveReadPrepare                               **
** (                                                                          **
**   Spi_SequenceType Sequence                                                **
** )                                                                          **
** [/cover]                                                                   **
**                                                                            **
** Service ID:  0x12                                                          **
**                                                                            **
** Sync/Async:  Asynchronous                                                  **
**                                                                            **
** Reentrancy:  Re-entrant                                                    **
**                                                                            **
** Parameters (in) : Sequence - Sequnece ID.                                  **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : E_OK - Reception command has been accepted.              **
**                   E_NOT_OK - Reception command has not been accepted.      **
**                                                                            **
** Description : Spi_SlaveReadPrepare to read/receive data on the SPI bus.    **
** This service takes over the given parameter 'Sequence', Queues jobs and    **
** Initializes QSPIx (connected to each job) to Slave Mode and starts         **
** receiving data on bus transmitted by QSPIy,configured in Master Mode.      **
**                                                                            **
** Jobs in each sequence are queued based on priority.                        **
**                                                                            **
** If Spi_SlaveReadPrepare service is called with new sequence when current   **
** sequence is ongoing then depending on configured parameter                 **
** 'Interruptible seq' or 'non-interruptible sequence' Jobs of each seq is    **
**  queued by calling local function Spi_JobSeqQueueUpdate.                   **
**                                                                            **
** This function is pre compile time selectable by the config parameter:      **
** SPI_LEVEL_DELIVERED. This function is only relevant for LEVEL 1 and  2.    **
**                                                                            **
** This service also updates slave bus status to SPI_BUSY, set the sequence   **
** result to SPI_SEQ_PENDING, set the first job result to                     **
** SPI_JOB_PENDING and return.                                                **
*******************************************************************************/
Std_ReturnType Spi_SlaveReadPrepare(Spi_SequenceType Sequence)
{
  uint32 RetVal;
  const Spi_SequenceConfigType* ParamSeqConfigPtr;
  uint32 HWUnit;
  uint32 SeqJobSharingStatus;
  uint16 JobId;
  uint16 FirstJobInQueue;
  uint8 IsQAvail;
  #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_OFF)
  uint16 Index;
  #endif
  /*(SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_OFF)*/
  uint32 JobCounter;

  JobCounter = 0U;
  RetVal = E_OK;

  /* Seq shall be within the specified range of values */
  if ((Sequence >= Spi_kSlaveConfigPtr->NoOfSequences))
  {

    /* Report to Safety error */
    SafeMcal_ReportError((uint16)SPI_MODULE_ID,SPI_INSTANCE_ID,
                  SPI_SLAVE_SID_READPREPARE,SPI_E_PARAM_SEQ);

