HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
    RetVal = E_NOT_OK;
  }

  if(RetVal == E_OK)
  {
    /*IFX_MISRA_RULE_17_04_STATUS="SpiSequenceConfigPtr" Pointer arithmetic used
      due to PBConfigStructure and is within allowed range.*/
    ParamSeqConfigPtr = &(Spi_kSlaveConfigPtr->SpiSequenceConfigPtr[Sequence]);
    IsQAvail = Spi_lIsQueueAvailable(ParamSeqConfigPtr->\
                                      JobsInParamSeq,&Spi_SlaveJobAndSeqAccess);

    if (IsQAvail == E_OK)
    {
      /* Get SPI SLAVE Bus */
      HWUnit = SPI_SLAVE_MODULE_INDEX;

     /* If the requested Sequence is already in the state SPI_SEQ_PENDING
     the SPI Slave does not take in account this new request and
     this service returns value E_NOT_OK. According to [SPI100],
     the SPI Handler/Driver shall report the SPI_E_SEQ_PENDING error.
     If the requested Sequence shares Jobs with another sequence
     that is in the state SPI_SEQ_PENDING, the SPI Handler/Driver does not
     take in account this new request and this service returns value E_NOT_OK.
     The SPI Slave shall report the SPI_E_SEQ_PENDNG error.*/

     /* ParamSeqConfigPtr->SeqSharingJobs : Holds for each sequence all the
     other sequences that shares a job with this sequence. The current
     sequence is also set.Spi_SeqStatus : Holds all pending sequences */

     if (SPI_SEQ_PENDING != (Spi_lSlaveGetSeqStatus(Sequence)))
     {
       SeqJobSharingStatus = Spi_lSlaveSeqSharingJobStatus(ParamSeqConfigPtr);
     }
     else
     {
       SeqJobSharingStatus = 1U;
     }

     if (SeqJobSharingStatus == 0U)
     {
       RetVal = E_OK;
       /* Set Sequence Status to Pending */
       /* set the sequence result to SPI_SEQ_PENDING */

       Spi_lSlaveSetSeqStatus(Sequence, SPI_SEQ_PENDING);

       /* If the bus attached to the lead job is free, start transmission
       immediately */

    #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_OFF)
       Index = Spi_SlaveJobAndSeqAccess.EndIndex;
       do
       {
         /* extract each job id from the sequence */
         /*IFX_MISRA_RULE_17_04_STATUS="JobLinkPtr" Pointer arithmetic used due
           to PBConfigStructure and is within allowed range.*/
         JobId = ParamSeqConfigPtr->JobLinkPtr[JobCounter];
         Spi_SlaveJobAndSeqAccess.JobQueue[Index] = JobId;
         Spi_SlaveJobAndSeqAccess.JobLinkedSeq[Index] = Sequence;

         Spi_lSlaveSetJobStatusAtomic(JobId,SPI_JOB_QUEUED );
         JobCounter++;
         Index = Spi_lIncrementAndRoundIndex(Index);
       /*IFX_MISRA_RULE_17_04_STATUS="JobLinkPtr" Pointer arithmetic used due to
         PBConfigStructure and is within allowed range.*/
       }while (ParamSeqConfigPtr->JobLinkPtr[JobCounter] != \
                                                 SPI_JOB_LINK_DELIMITER);
       Spi_SlaveJobAndSeqAccess.EndIndex = Index;
    #else
      do
      {
        /* extract each job id from the sequence */
        /*IFX_MISRA_RULE_17_04_STATUS="JobLinkPtr" Pointer arithmetic used due
          to PBConfigStructure and is within allowed range.*/
        JobId = ParamSeqConfigPtr->JobLinkPtr[JobCounter];

        Spi_lSlaveSetJobStatusAtomic(JobId, SPI_JOB_QUEUED );
        JobCounter++;
      /*IFX_MISRA_RULE_17_04_STATUS="JobLinkPtr" Pointer arithmetic used due to
        PBConfigStructure and is within allowed range.*/
      }while (ParamSeqConfigPtr->JobLinkPtr[JobCounter] != \
                                                 SPI_JOB_LINK_DELIMITER);

      Spi_lIntSeqAsyncTransmit(Sequence,&Spi_SlaveJobAndSeqAccess);
    #endif
     /*(SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_OFF)*/

     if (Spi_SlaveBusStatus == SPI_IDLE)
      {
        /* Store the pending Sequence and its first Job in the SPI Bus */
        /* set the SPI Handler/Driver status to SPI_BUSY */
        Spi_SlaveBusStatus = SPI_BUSY;

        /* To start the first job transmission */
        FirstJobInQueue = Spi_SlaveJobAndSeqAccess.JobQueue[0U];

        /* Set First Job Index in the Status Array */
        #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_OFF)
        Spi_SlaveJobAndSeqAccess.CurrentJobIndex = 0U;
        /* Set First Job Index in the Status Array */
        #else /* (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON) */
        Spi_SlaveJobAndSeqAccess.CurrentJobIndex[Sequence]= 0U;
        #endif

        #if ((SPI_CANCEL_API == STD_ON) && (SPI_LEVEL_DELIVERED != 0U))
        Spi_lSlaveClrSeqCancelStatus(Sequence);
        #endif

        /* Id should be incremented first and Job should be started.
             Reason:
             For an empty Queue, a request comes with no of jobs that is
             equal to the Queue size, in this scenario , the Queue should
             be assigned to full status before starting a job.
        */

        Spi_SlaveJobAndSeqAccess.StartIndexExtractJobId++;
        Spi_lSlaveStartJob(HWUnit ,FirstJobInQueue );
      }
      else
      {
        /* Set First Job Index in the Status Array */
        #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)
        Spi_SlaveJobAndSeqAccess.CurrentJobIndex[Sequence] = 0U;
        #else
        Spi_SlaveJobAndSeqAccess.CurrentJobIndex = 0U;
        #endif
      }
     }
     else
     {
       RetVal = E_NOT_OK;
     }

    }
    else
    {
      RetVal = E_NOT_OK;
    }
  }
  else
  {

    RetVal = E_NOT_OK;

  }

  Spi_lSlaveWriteTransmit();

  return ((Std_ReturnType)RetVal);
}

/*******************************************************************************
** Syntax : static uint8 Spi_lSlaveSeqSharingJobStatus                        **
** (                                                                          **
**   Spi_SequenceConfigType* SeqConfigPtr                                     **
** )                                                                          **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Re-entrant                                                    **
**                                                                            **
** Parameters (in) : SeqConfigPtr - sequence configuration                    **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : return 1: jobs are shared across sequences               **
**                                                                            **
**                                                                            **
** Description : returns value 1, on finding the jobs shared by the sequences **
*******************************************************************************/
static uint8 Spi_lSlaveSeqSharingJobStatus
(
  const Spi_SequenceConfigType* SeqConfigPtr
)
{

  uint32 Index;
  Spi_SequenceType SeqId;
  uint8 JobSharingStatus;

