HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
  Index = 0U;
  JobSharingStatus = 0U;
  if (SeqConfigPtr->SeqSharingJobs != NULL_PTR)
  {
    do
    {
      /*IFX_MISRA_RULE_17_04_STATUS="SeqSharingJobs" Pointer arithmetic used due
        to PBConfigStructure and is within allowed range.*/
      SeqId = (Spi_SequenceType)SeqConfigPtr->SeqSharingJobs[Index];
      if (SPI_SEQ_PENDING == Spi_lSlaveGetSeqStatus(SeqId))
      {
        JobSharingStatus = 1U;
      }
      Index++;
    /*IFX_MISRA_RULE_17_04_STATUS="SeqSharingJobs" Pointer arithmetic used due
      to PBConfigStructure and is within allowed range.*/
    }while ((SeqConfigPtr->SeqSharingJobs[Index] != \
                   SPI_SHARED_JOBS_DELIMITER) && (JobSharingStatus == 0U));
  }/*(ParamSeqConfigPtr->SeqSharingJobs != NULL_PTR)*/
  return (JobSharingStatus);
}
/*******************************************************************************
** Syntax : static void Spi_lSlaveStartJob                                    **
** (                                                                          **
**   uint32 Module,                                                           **
**   Spi_JobType JobId                                                        **
** )                                                                          **
** [/cover]                                                                   **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Re-entrant  (for different JobIds)                            **
**                                                                            **
** Parameters (in) : Module - ModuleId                                        **
**                   Job    - JobId                                           **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : None                                                     **
**                                                                            **
**                                                                            **
** Description : Sets up the SPI Slave HW According to Job Parameters.        **
**               Call to Start Channel                                        **
**                                                                            **
** This function configures the Slave hardware (job related                   **
** configuration like timing parameters and selection of QSPI MODE i.e,       **
** Master or Slave) for the reception of data and calls the start channel     **
** function to configure data width.                                          **
*******************************************************************************/
static void Spi_lSlaveStartJob(uint32 Module, Spi_JobType JobId)
{
  const Spi_JobConfigType* JobConfigPtr;
  Spi_ChannelType Channel;
  Ifx_QSPI* ModulePtr;
  uint32 DelayAndHwChNo;

  /*IFX_MISRA_RULE_17_04_STATUS="SpiJobConfigPtr" Pointer arithmetic used due to
    PBConfigStructure and is within allowed range.*/
  JobConfigPtr = &(Spi_kSlaveConfigPtr->SpiJobConfigPtr[JobId]);
  Spi_SlaveChnlAccess[0U].CurrentChannelIndex = 0U;
  /*IFX_MISRA_RULE_17_04_STATUS="ChannelLinkPtr" Pointer arithmetic used due to
    PBConfigStructure and is within allowed range.*/
  Channel = JobConfigPtr->ChannelLinkPtr[0U];
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ModulePtr =  &(SPI_HW_MODULE[Module]);

  /* set the first job result to SPI_JOB_PENDING */
  Spi_lSlaveSetJobStatusAtomic(JobId,SPI_JOB_PENDING);

  /* Configure the Job parameters like Mod En, baudrate (TQ, Q, A, B, C),
     Event enable (Error enable, TxEn, Rxen,
     EXPECT  = max_value, clock Phase & polarity
     Delay Parameters (Lead,Trail,Idle)
  */
  Spi_lSlaveHwSetJobConfig(ModulePtr, JobConfigPtr);

  Spi_lSlaveHwEnableQspiRxIntr(Module);

  Spi_lSlaveHwEnableQspiErrIntr(Module);

  DelayAndHwChNo = JobConfigPtr->TimeDelayConfig |
              (( ((uint32)JobConfigPtr->HwUnit >> SPI_HWUNIT_CH_SHIFT)
              &  SPI_HWUNIT_MASK) <<   SPI_CONFIG_HWCHANNELNO_SHIFT);
  Spi_lSlaveStartChannel(Module, Channel, DelayAndHwChNo, 
                                      ((uint8)(JobConfigPtr->ParitySelection)));
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE void Spi_lSlaveHwEnableQspiRxIntr      **
** (                                                                          **
**   uint32 Module                                                            **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Module - Hw module no.                                  **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to Enable Spi Slave Hw Rx Interrupt            **
*******************************************************************************/
 IFX_LOCAL_INLINE void Spi_lSlaveHwEnableQspiRxIntr(uint32 Module)
{
  MODULE_SRC.QSPI.QSPI[Module].RX.B.CLRR = 1U;
  MODULE_SRC.QSPI.QSPI[Module].RX.B.SWSCLR = 1U;
  MODULE_SRC.QSPI.QSPI[Module].RX.B.IOVCLR = 1U;

  MODULE_SRC.QSPI.QSPI[Module].RX.B.SRE = 1U; /*  Enable intr */
}

