HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE void Spi_lSlaveHwDisableQspiRxIntr     **
** (                                                                          **
**   uint32 Module                                                            **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Module - Hw module no.                                  **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to Disable Spi Slave Hw Rx Interrupt           **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveHwDisableQspiRxIntr(uint32 Module)
{
  if(MODULE_SRC.QSPI.QSPI[Module].RX.B.SRE  == 1U)
  {
    MODULE_SRC.QSPI.QSPI[Module].RX.B.CLRR = 1U;
    MODULE_SRC.QSPI.QSPI[Module].RX.B.IOVCLR = 1U;
    MODULE_SRC.QSPI.QSPI[Module].RX.B.SWSCLR = 1U;
    MODULE_SRC.QSPI.QSPI[Module].RX.B.SRE = 0U; /*  Disable intr */
  }
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE void Spi_lSlaveHwEnableQspiErrIntr     **
** (                                                                          **
**   uint32 Module                                                            **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Module - Hw module no.                                  **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to Enable Spi Slave Hw Rx Interrupt            **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveHwEnableQspiErrIntr(uint32 Module)
{
  MODULE_SRC.QSPI.QSPI[Module].ERR.B.CLRR   = 1U;
  MODULE_SRC.QSPI.QSPI[Module].ERR.B.SWSCLR = 1U;
  MODULE_SRC.QSPI.QSPI[Module].ERR.B.IOVCLR = 1U;
  /*  Enable intr */
  MODULE_SRC.QSPI.QSPI[Module].ERR.B.SRE = 1U;
}

/*******************************************************************************
** Syntax : static void Spi_lSlaveStartChannel                                **
** (                                                                          **
**   uint32 Module,                                                           **
**   Spi_ChannelType Channel, uint32 DelayAndHwChNo, uint8 ParityConfig       **
** )                                                                          **
** [/cover]                                                                   **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Re-entrant (for different channel Ids)                        **
**                                                                            **
** Parameters (in) :   Module - ModuleId                                      **
**                     ChannelType  - Channel                                 **
**                     DelayAndHwChNo - configured delay and channel          **
**                     ParityConfig - Parity selection                        **
**                                                                            **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    :                                                          **
**                                                                            **
**                                                                            **
** Description :This function configures the QSPI and Dma hardware for        **
**              the channel reception                                         **
*******************************************************************************/
static void Spi_lSlaveStartChannel(uint32 Module, Spi_ChannelType Channel,
       uint32 DelayAndHwChNo, uint8 ParityConfig)
{
  const Spi_ChannelConfigType* ChannelConfigPtr;
  Spi_DataType *DmaDestPtr;
  uint32 DmaReceiveCount;
  Spi_SlaveEBBufferType* EBBufferPtr;

  /*IFX_MISRA_RULE_17_04_STATUS="SpiChannelConfigPtr" Pointer arithmetic used
    due to PBConfigStructure and is within allowed range.*/
  ChannelConfigPtr = &(Spi_kSlaveConfigPtr->SpiChannelConfigPtr[Channel]);
  EBBufferPtr = &(Spi_SlaveEBBuffer[Channel]);
  DmaDestPtr = EBBufferPtr->DestPtr;
  DmaReceiveCount  = (uint32)EBBufferPtr->Length;

