HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
  /*Data Width > 16 bits*/
  if (ChannelConfigPtr->DataConfig & SPI_32BIT_DATAMASK)
  {
    /* DmaReceiveCount is div by 4 to convert transfers as 32 bit from 8 bit */
    DmaReceiveCount = (DmaReceiveCount >> SPI_RECEIVECOUNT_SHIFT_32BIT) ;
  }
  /*Data Width > 8 bits*/
  else if (ChannelConfigPtr->DataConfig & SPI_16BIT_DATAMASK)
  {
    /* DmaReceiveCount is div by 2 to convert transfers as 16 bit from 8 bit */
    DmaReceiveCount = (DmaReceiveCount >> SPI_RECEIVECOUNT_SHIFT_16BIT) ;
  }
  else
  {
      /* Data Width is equal to 8 bits */
  }

  Spi_lSlaveHwSetChannelConfig(Module, ChannelConfigPtr->DataConfig,
                           DelayAndHwChNo, ParityConfig);

  /* Start Dma Reception */
  Spi_lSlaveHwDmaStartReception(DmaDestPtr, DmaReceiveCount,
                          ChannelConfigPtr->DataConfig);

}
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE void Spi_lSlaveHwDmaStartReception     **
** (                                                                          **
**   uint32 Module,                                                           **
**   Spi_DataType* DmaRxDestPtr,                                              **
**   uint32 DmaReceiveCount,                                                  **
**   uint16 DataWidth,                                                        **
** )                                                                          **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Module - Hw Module.                                     **
**                    DmaRxDestPtr - Rx-Dma Channel Destination Pointer       **
**                    DmaReceiveCount - Dma Receive Count                     **
**                    DataWidth - DataWidth of Rx Dma channels                **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to Start transfer of Dma Rx Channels.          **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveHwDmaStartReception
(
Spi_DataType* DmaRxDestPtr,
uint32 DmaReceiveCount,
uint16 DataWidth
)
{
  Dma_ChannelType DmaRxChannel;
  uint32 DmaRxAddressControlRegVal;
  uint32 DmaDataWidth;

  DmaRxChannel = Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel;

  /*IFX_MISRA_RULE_11_01_STATUS=Typecasting DmaRxDestPtr to uint32 is unvoidable
    DmaRxDestPtr is later used for SFR assignment.*/
  /*IFX_MISRA_RULE_11_03_STATUS=Type cast to uint32 is unavoidable*/
  Mcal_DmaSetDestAddr(DmaRxChannel, (uint32)DmaRxDestPtr);

  DmaRxAddressControlRegVal = SPI_DMA_RX_ADRCR_NORML_TRANSFER;

  /* Set Address Ctr Reg RX*/
  Mcal_DmaSetAdicr(DmaRxChannel, DmaRxAddressControlRegVal);

  /* Clear Pending Interrupt */
  Spi_lSlaveHwDmaClearIntr(DmaRxChannel);

  if ( DataWidth & SPI_32BIT_DATAMASK)
  {
    DmaDataWidth = SPI_DMA_CHDW_32BIT;
  }
  else if ( DataWidth & SPI_16BIT_DATAMASK)
  {
    DmaDataWidth = SPI_DMA_CHDW_16BIT;
  }
  else
  {
    DmaDataWidth = SPI_DMA_CHDW_8BIT;
  }

  /* SetChannel Control Reg : RX */
  Mcal_DmaSetTxCount(DmaRxChannel, DmaReceiveCount);
  Mcal_DmaSetDataWidth(DmaRxChannel, DmaDataWidth);

  /* Set Hardware Trigger Request on the Channels */
  Mcal_DmaEnableHwTransfer(DmaRxChannel);
}
/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE void Spi_lSlaveHwDmaClearIntr          **
** (                                                                          **
**   uint32 Module                                                            **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Module - Hw module no.                                  **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to Clear Dma Hw channel Interrupt              **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveHwDmaClearIntr(Dma_ChannelType Channel)
{
  Ifx_SRC_SRCR_Bits IntrSrc;
  volatile Ifx_SRC_SRCR_Bits *MoveEngCh0BaseAddr;

  Mcal_DmaChClrIntctEtrlFlags(Channel);
  Mcal_DmaChClrIntrFlags(Channel);
  /* Set Interrupt Control */
  Mcal_DmaCfgIntControl(Channel,SPI_DMA_INTCT);

  MoveEngCh0BaseAddr = SRC_DMACH0ADDR;

  /*IFX_MISRA_RULE_11_05_STATUS="MoveEngCh0BaseAddr" attempt to cast away
    volatile in terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="MoveEngCh0BaseAddr" Pointer arithmetic is used
    to efficiently access the SFRs of multiple QSPI Modules.*/
  IntrSrc = *((volatile Ifx_SRC_SRCR_Bits *)(void *)MoveEngCh0BaseAddr +
                                                             (uint8)Channel);
  IntrSrc.CLRR = 1U;
  /*IFX_MISRA_RULE_11_05_STATUS="MoveEngCh0BaseAddr" attempt to cast away
    volatile in terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="MoveEngCh0BaseAddr" Pointer arithmetic is used
    to efficiently access the SFRs of multiple QSPI Modules.*/
  *((volatile Ifx_SRC_SRCR_Bits *)(void *)MoveEngCh0BaseAddr + (uint8)Channel)
                                                  = IntrSrc;
}
/*******************************************************************************
** Syntax           : void Spi_lSlaveBusHandler                               **
**                    (                                                       **
**                      uint32 Module                                         **
**                    )                                                       **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-Reentrant                                           **
**                                                                            **
** Parameters (in)  : Module- SPI Slave Bus Id.                               **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : The Slave Bus Handler should be called from Isr of      **
** DMA RX when received data count is equal to DmaReceiveCount.               **
**                                                                            **
** The Slave Bus handler performs the following:                              **
** 1.Starts next Channel Reception                                            **
** 2.If the last channel is reached starts next Slave Job.                    **
**   (Schedule function is called)                                            **
** 3.If the last job is reached starts next pending sequence                  **
**   (Schedule function is called)                                            **
**                                                                            **
*******************************************************************************/
void Spi_lSlaveBusHandler(uint32 Module)
{
  uint32 HWUnit;
  uint16 JobId;
  uint16 SICompletedJob;
  Spi_SequenceType CompletedJobSeqId;
  Spi_ChannelType ChannelId;
  uint16 ExtractJobId;
  uint16 EndIndex;
  const Spi_JobConfigType* JobConfigPtr;
  const Spi_SequenceConfigType* SeqConfigPtr;
  uint32 DelayAndHwChNo;
  #if (SPI_CANCEL_API == STD_ON)
  Spi_JobAndSeqAccessType  *JobSeqDataPtr;
  #endif

  SICompletedJob = Spi_lSlaveCompletedJobId();
  /* last job completed */
  /* extract the completed Job Id */
  JobId = Spi_SlaveJobAndSeqAccess.JobQueue[SICompletedJob];
  /* Increment Channel Index to the next Channel in the Job Link */
  Spi_SlaveChnlAccess[0U].CurrentChannelIndex++;
  /*IFX_MISRA_RULE_17_04_STATUS="SpiJobConfigPtr" Pointer arithmetic used due to
    PBConfigStructure and is within allowed range.*/
  JobConfigPtr = &(Spi_kSlaveConfigPtr->SpiJobConfigPtr[JobId]);
  /*IFX_MISRA_RULE_17_04_STATUS="ChannelLinkPtr" Pointer arithmetic used due to
    PBConfigStructure and is within allowed range.*/
  ChannelId = JobConfigPtr->ChannelLinkPtr[Spi_SlaveChnlAccess[0U].\
                                                           CurrentChannelIndex];

  /*Last Channel already transmitted. i.e end of job/seq*/
  if (ChannelId == SPI_CHANNEL_LINK_DELIMITER)
  {
    #if (SPI_CANCEL_API == STD_ON)
    JobSeqDataPtr = &Spi_SlaveJobAndSeqAccess;
    #endif

    Spi_lHwDisableQspiErrIntr(Module);

    Spi_lSlaveHwDisableQspiRxIntr(Module);

    Spi_lSlaveSetJobStatusAtomic(JobId, SPI_JOB_OK);
    CompletedJobSeqId = Spi_SlaveJobAndSeqAccess.JobLinkedSeq[SICompletedJob];
    /*IFX_MISRA_RULE_17_04_STATUS="SpiSequenceConfigPtr" Pointer arithmetic used
      due to PBConfigStructure and is within allowed range.*/
    SeqConfigPtr = &(Spi_kSlaveConfigPtr->\
                                       SpiSequenceConfigPtr[CompletedJobSeqId]);

    #if (SPI_CANCEL_API == STD_ON)
    Spi_lSlaveSeqCancelled(JobSeqDataPtr);
    #endif

    #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)
    /* Increment Job Index to the next Job in the Job Link */
    Spi_SlaveJobAndSeqAccess.CurrentJobIndex[CompletedJobSeqId]++ ;
    #else
    Spi_SlaveJobAndSeqAccess.CurrentJobIndex++;
    #endif
    /*(SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)*/

    #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)
    /*IFX_MISRA_RULE_17_04_STATUS="JobLinkPtr" Pointer arithmetic used due to
      PBConfigStructure and is within allowed range.*/
    if (SeqConfigPtr->JobLinkPtr[Spi_SlaveJobAndSeqAccess.\
        CurrentJobIndex[CompletedJobSeqId]] == SPI_JOB_LINK_DELIMITER)
    #else
    /*IFX_MISRA_RULE_17_04_STATUS="JobLinkPtr" Pointer arithmetic used due to
      PBConfigStructure and is within allowed range.*/
    if (SeqConfigPtr->JobLinkPtr[Spi_SlaveJobAndSeqAccess.CurrentJobIndex] == \
                                                      SPI_JOB_LINK_DELIMITER)
    #endif
    /*(SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)*/
    {
      #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)
      Spi_SlaveJobAndSeqAccess.CurrentJobIndex[CompletedJobSeqId] = 0U;
      #else
      Spi_SlaveJobAndSeqAccess.CurrentJobIndex = 0U;
      #endif
      /*(SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)*/
      /* Set Sequence to Idle to indicate that another Transmission can be
         Started on any other sequence that shared a job with this sequence */
      Spi_lSlaveSetSeqStatusAtomic(CompletedJobSeqId, SPI_SEQ_OK);
    }

    /*Fix for AI00254397 */
    SchM_Enter_Spi_AsyncTransmit(); /* Enter Critical Section: EnterKey-A */
    /* The variables are read into local variables to remove Misra 1.2 */
    ExtractJobId = Spi_SlaveJobAndSeqAccess.StartIndexExtractJobId;
    EndIndex = Spi_SlaveJobAndSeqAccess.EndIndex;

