HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
    if (ExtractJobId != EndIndex)
    {
      JobId = Spi_SlaveJobAndSeqAccess.\
                      JobQueue[Spi_SlaveJobAndSeqAccess.StartIndexExtractJobId];
      /* Get SPI Bus. The SPI bus is extracted from each job. */
      HWUnit = SPI_SLAVE_MODULE_INDEX;
      Spi_SlaveJobAndSeqAccess.StartIndexExtractJobId = \
          Spi_lIncrementAndRoundIndex(Spi_SlaveJobAndSeqAccess. \
                                              StartIndexExtractJobId);
      /* Exit Critical Section asap for minimal blocking time: ExitKey-A1*/
      SchM_Exit_Spi_AsyncTransmit();
      Spi_lSlaveStartJob(HWUnit, JobId);
    }
    else
    {
      Spi_SlaveBusStatus = SPI_IDLE;
      Spi_SlaveJobAndSeqAccess.EndIndex = 0U;
      Spi_SlaveJobAndSeqAccess.StartIndexExtractJobId = 0U;
      /* Exit Critical Section asap for minimal blocking time: ExitKey-A2*/
      SchM_Exit_Spi_AsyncTransmit();
    }/*(Spi_StartIndexExtractJobId != Spi_EndIndex)*/
  }/*(ChannelId == SPI_CHANNEL_LINK_DELIMITER)*/
  else
  {
    DelayAndHwChNo = JobConfigPtr->TimeDelayConfig|
         ((((uint32)JobConfigPtr->HwUnit >> SPI_HWUNIT_CH_SHIFT) &
         SPI_HWUNIT_MASK) <<  SPI_CONFIG_HWCHANNELNO_SHIFT);

    Spi_lSlaveStartChannel(Module, ChannelId, DelayAndHwChNo, 
                                      ((uint8)(JobConfigPtr->ParitySelection)));
  }
}
/*******************************************************************************
** Syntax           : void Spi_lSlaveErrorHandler                             **
**                    (                                                       **
**                      uint32 Module,                                        **
**                      uint32 DemError                                       **
**                    )                                                       **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non-Reentrant                                           **
**                                                                            **
** Parameters (in)  : Module- SPI Slave Bus Id.                               **
**                    DemError-Dem Error ID                                   **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : The Slave Error Handler should be called from Isr of    **
** DMA RX when received data count is equal to                                **
** DmaReceiveCount and Error as occured                                       **
*******************************************************************************/
void Spi_lSlaveErrorHandler(uint32 Module, uint32 DemError)
{
  Spi_JobAndSeqAccessType *JobSeqDataPtr;
  Spi_JobType JobId;
  uint16 CompletedJobSeqIndex;
  Spi_SequenceType SeqId;
  uint16 ExtractJobId;
  uint16 EndIndex;
  uint32 HWUnit;
  uint8 Seqbool;
  uint8 NextSeqId;
  uint16 StartIndex;

  JobSeqDataPtr = &Spi_SlaveJobAndSeqAccess;

  /* Production relevant errors shall be reported to the Diagnostic
     Event Manager (DEM). They shall not be used as the return value of the
     called function.*/
  if (DemError == (uint32)SPI_DEM_HW_ERROR)
  {
    #if (SPI_HW_ERROR_DEM_REPORT == ENABLE_DEM_REPORT)
    /* Dem for receive error*/
      Dem_ReportErrorStatus(SPI_E_HARDWARE_ERROR,
               DEM_EVENT_STATUS_FAILED);
    #endif
  }

  CompletedJobSeqIndex = Spi_lSlaveCompletedJobId();
  /* last job completed */
  /* extract the completed Job Id */
  JobId = JobSeqDataPtr->JobQueue[CompletedJobSeqIndex];
  SeqId = (uint8)JobSeqDataPtr->JobLinkedSeq[CompletedJobSeqIndex];

  /* Indicate Failure in Job */
  Spi_lSlaveSetJobStatusAtomic(JobId, SPI_JOB_FAILED);
  /* Set Sequence to Idle to indicate that another Transmission can be
     Started on any other sequence that shared a job with this sequence */
  Spi_lSlaveSetSeqStatusAtomic(SeqId, SPI_SEQ_FAILED);

  Spi_lSlaveHwDisableModule(Module);

  Spi_lSlaveHwDisableQspiRxIntr(Module);

  Spi_lHwDisableQspiErrIntr(Module);

  /*Fix for AI00254397 */
  SchM_Enter_Spi_AsyncTransmit(); /* Enter Critical Section: EnterKey-B */
  StartIndex = JobSeqDataPtr->StartIndexExtractJobId ;
  Seqbool = 0U;
  while ((StartIndex != JobSeqDataPtr->EndIndex) && (Seqbool == 0U))
  {
    NextSeqId = JobSeqDataPtr->JobLinkedSeq[StartIndex];
    if (Spi_lSlaveGetSeqStatus(NextSeqId) == SPI_SEQ_FAILED)
    {

      StartIndex = Spi_lIncrementAndRoundIndex(StartIndex);
    }
    else
    {
      Seqbool = 1U;
    }
  }
  JobSeqDataPtr->StartIndexExtractJobId = StartIndex;

  #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)
  JobSeqDataPtr->CurrentJobIndex[SeqId] = 0U;
  #else
  JobSeqDataPtr->CurrentJobIndex = 0U;
  #endif
  /*(SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)*/

  /* The variables are read into local variables to remove Misra 1.2 */
  ExtractJobId = JobSeqDataPtr->StartIndexExtractJobId;
  EndIndex = JobSeqDataPtr->EndIndex;

  if (ExtractJobId != EndIndex)
  {
    JobId = JobSeqDataPtr->JobQueue[JobSeqDataPtr->StartIndexExtractJobId];
    /*       Get SPI Bus. The SPI bus is extracted from each job .*/
    HWUnit = SPI_SLAVE_MODULE_INDEX;

    JobSeqDataPtr->StartIndexExtractJobId = \
       Spi_lIncrementAndRoundIndex(JobSeqDataPtr->StartIndexExtractJobId);
    /* Exit Critical Section asap for minimal blocking time: ExitKey-B1*/
    SchM_Exit_Spi_AsyncTransmit();
    Spi_lSlaveStartJob(HWUnit, JobId);
  }
  else
  {

    Spi_SlaveBusStatus = SPI_IDLE;
    JobSeqDataPtr->EndIndex = 0U;
    JobSeqDataPtr->StartIndexExtractJobId = 0U;
    /* Exit Critical Section asap for minimal blocking time: ExitKey-B2*/
    SchM_Exit_Spi_AsyncTransmit();
  }/*(ExtractJobId != EndIndex)*/

