HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
}

/*******************************************************************************
** Syntax           :  IFX_INLINE void Spi_lSlaveHwDisableModule              **
** (                                                                          **
**   uint32 Module                                                            **
** )                                                                          **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Module - Module no                                      **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Disable the Module at the end of Job transmission.      **
*******************************************************************************/
IFX_INLINE void Spi_lSlaveHwDisableModule(uint32 Module)
{
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  SPI_HW_MODULE[(uint8)Module].GLOBALCON.B.RESETS =
    SPI_QSPI_RST_STATEMCHNEANDFIFO;
}

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE uint16 Spi_lSlaveCompletedJobId(void)  **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : None.                                                   **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : This function returns the id of the completed job       **
*******************************************************************************/
IFX_LOCAL_INLINE uint16 Spi_lSlaveCompletedJobId(void)
{
  uint16 CompletedJobId;

  if (Spi_SlaveJobAndSeqAccess.StartIndexExtractJobId == 0U)
  {
    CompletedJobId = (SPI_MAX_JOB_TRIG_Q_LENGTH - 1U);
  }
  else
  {
    CompletedJobId = (Spi_SlaveJobAndSeqAccess.StartIndexExtractJobId - 1U);
  }

  return (CompletedJobId);
}

/*******************************************************************************
** Syntax       : static void Spi_lSlaveHwSetJobConfig                        **
**                (                                                           **
**                  Ifx_QSPI* ModulePtr,                                      **
**                  const Spi_JobConfigType* JobConfigPtr                     **
**                                                                            **
**                )                                                           **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : ModulePtr - Slave Hw module pointer.                    **
**                    BaudRateConfig - Packed variable for Baud Rate          **
                                  Configuration Parameters TQ, Q, A, B, C     **
**                    Config  -   Data Config parameters & Qspi Channel no    **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to Set Slave Job Configuration Parameters      **
*******************************************************************************/
static void Spi_lSlaveHwSetJobConfig(volatile Ifx_QSPI* ModulePtr,
                                        const Spi_JobConfigType* JobConfigPtr)
{

  /*
  Packed variable for Baud Rate Configuration Parameters TQ, Q, A, B, C
  bit 0-7: TQ;bit 8-13 : Q;bit 16-17 : A;bit 18-19 : B;bit 20-21 : C
  */

