HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
  Ifx_QSPI_GLOBALCON GlobalConReg;
  Ifx_QSPI_GLOBALCON1 GlobalCon1Reg;
  uint32 BaudRateConfigVal;
  uint16 Tqval;

#if(SPI_BAUDRATE_AT_RUNTIME == STD_ON)
  Ifx_QSPI_ECON EconReg;
  uint16 Qval;
  uint8 Aval, Bval, Cval;
  uint8 HwChannelno;
#endif /* SPI_BAUDRATE_AT_RUNTIME == STD_ON */

  /*
  Baudrate or SCLK = 1 /( (1/fQSPI) * GLOBALCON.TQ * ECONz.Q *[A+B+C]) bps
  GLOBALCON.TQ : Global Time Quantum - Common n-divider scaling the baud rates
           of all channels in direction of higher or lower baud rates
           0 = div by 1, 255 = div by 256
  ECONz.Q : Time Quantum - Defines the time quantum length used by A, B, and C
            to define the baud rate and duty cycle
            6b'000000 =  1, 6b'111111 = 64

  BaudRateConfig :
  bit 0-7: TQ
  bit 8-13 : Q
  bit 16-17 : A
  bit 18-19 : B
  bit 20-21 : C
  */

  BaudRateConfigVal = JobConfigPtr->BaudRateConfig;

  /*AI00249920: ECON is setup in Spi_lSlaveInit() */
  Tqval = (uint16)((uint16)BaudRateConfigVal & SPI_BAUDRATECONFIG_TQ_MASK);

  GlobalConReg.U = ModulePtr->GLOBALCON.U;
  GlobalCon1Reg.U = ModulePtr->GLOBALCON1.U;

  GlobalConReg.B.LB = SPI_QSPI_LOOPBACK_DISABLE;   /* loop back disabled */

  GlobalConReg.B.SI = SPI_QSPI_SI_DISABLE;   /* Status Injection disabled. */
  GlobalConReg.B.EXPECT = SPI_QSPI_EXPECT_VALUE;   /*  expect time to Max */
  GlobalConReg.B.SRF = SPI_QSPI_SRF_DISABLE;    /* dont Stop on RXFIFO full. */
  GlobalConReg.B.EN = SPI_QSPI_MODULE_ENABLE;
  GlobalConReg.B.TQ = Tqval;

  /* Ensuring no resets */
  GlobalConReg.B.RESETS = 0U;
  GlobalCon1Reg.B.ERRORENS = SPI_QSPI_ERRORENS_VALUE;
 /* GlobalCon1Reg.B.TXFIFOINT = SPI_QSPI_RXFIFOINT_VALUE;*/
  GlobalCon1Reg.B.RXFIFOINT = 0U;
  GlobalCon1Reg.B.TXEN = SPI_QSPI_INT_DISABLE;
  GlobalCon1Reg.B.RXEN = SPI_QSPI_INT_ENABLE;
  GlobalCon1Reg.B.RXFM = 1U; /* Single Move Mode */
  GlobalCon1Reg.B.TXFM = 1U; /* Single Move Mode */

#if(SPI_BAUDRATE_AT_RUNTIME == STD_ON)

  Qval = ((uint16)(BaudRateConfigVal >> SPI_BAUDRATECONFIG_Q_SHIFT)
                            & SPI_BAUDRATECONFIG_Q_MASK);
  Aval = ((uint8)(BaudRateConfigVal >> SPI_BAUDRATECONFIG_A_SHIFT)
                            & SPI_BAUDRATECONFIG_A_MASK);
  Bval = ((uint8)(BaudRateConfigVal >> SPI_BAUDRATECONFIG_B_SHIFT)
                            & SPI_BAUDRATECONFIG_B_MASK);
  Cval = ((uint8)(BaudRateConfigVal >> SPI_BAUDRATECONFIG_C_SHIFT)
                            & SPI_BAUDRATECONFIG_C_MASK);
  /* HW channels vary from 0 - 15
     but the ECON maps 8 - 15 to 0 to 7.   */
  HwChannelno = ((uint8)(JobConfigPtr->HwUnit) >> SPI_HWUNIT_CH_SHIFT);

  EconReg.U = ModulePtr->ECON[HwChannelno & SPI_QSPI_HWCHANNELNO_MASK].U;

  EconReg.B.CPH = (((uint8)(JobConfigPtr->ShiftClkConfig))
                                             & SPI_QSPI_CLOCKPHASE_MASK);
  EconReg.B.CPOL = ((uint8)((JobConfigPtr->ShiftClkConfig)
                   >> SPI_QSPI_CLOCKPOL_SHIFT) & SPI_QSPI_CLOCKPOL_MASK);

  if(((uint8)JobConfigPtr->ParitySelection) == SPI_QSPI_PARITY_UNUSED)
  {
    /* Transmit/Receive parity Disabled */
    EconReg.B.PAREN = SPI_QSPI_PARITY_DISABLE;
  }
  else
  {
    /* Transmit/Receive parity Enabled */
    EconReg.B.PAREN = SPI_QSPI_PARITY_ENABLE;
  }
  
  /* Configure the ECON Baudrate params */
  EconReg.B.Q = (uint8)Qval;
  EconReg.B.A = (uint8)Aval;
  EconReg.B.B = (uint8)Bval;
  EconReg.B.C = (uint8)Cval;
  
  ModulePtr->ECON[HwChannelno & SPI_QSPI_HWCHANNELNO_MASK].U = EconReg.U;

#endif /* SPI_BAUDRATE_AT_RUNTIME == STD_ON */

  ModulePtr->GLOBALCON.U = GlobalConReg.U;
  ModulePtr->GLOBALCON1.U = GlobalCon1Reg.U;
  ModulePtr->FLAGSCLEAR.U = (SPI_QSPI_FLAGSCLEAR_VALUE) ;

}

/*******************************************************************************
** Traceability : []
** Syntax           : IFX_LOCAL_INLINE void Spi_lSlaveHwSetConfigExtn         **
** (                                                                          **
**   const Spi_ConfigType* ConfigPtr                                          **
** )                                                                          **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : ConfigPtr  -   init config pointer                      **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to Set the ECON register Parameters            **
*******************************************************************************/
#if(SPI_BAUDRATE_AT_RUNTIME == STD_OFF)
IFX_LOCAL_INLINE void Spi_lSlaveHwSetConfigExtn(const Spi_ConfigType* ConfigPtr)
{
    Ifx_QSPI* ModulePtr;
    uint8 HwChannelno;
    uint8 AsilModule;
    uint8 EconCntr;

    EconCntr = 0U;
    do
    {
      /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used
       to efficiently access the SFRs of multiple QSPI Modules.*/
      AsilModule = ((ConfigPtr->SpiBaudrateEconPtr)[EconCntr].QSPIHwUnit
                                                           & SPI_HWUNIT_MASK);
      if(
         ((uint32)SPI_ASIL_MASTER_MODULE_USED & \
                                         ((uint32)0x01U << AsilModule)) == 1U
        )
      {
 /*IFX_MISRA_RULE_17_04_STATUS="SpiBaudrateEconPtr" Pointer arithmetic is used
       to efficiently access the SFRs of multiple QSPI Modules.*/
        HwChannelno = ((((ConfigPtr->SpiBaudrateEconPtr)[EconCntr].QSPIHwUnit)\
               >> SPI_HWUNIT_CH_SHIFT) & SPI_QSPI_HWCHANNELNO_MASK);

