HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
      /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away
       volatile in terms of pointer access.*/
     /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used
       to efficiently access the SFRs of multiple QSPI Modules.*/
        ModulePtr =  &(SPI_HW_MODULE[(uint8)SPI_SLAVE_MODULE_INDEX]);


        /* Write parameters to ECON register */
/*IFX_MISRA_RULE_17_04_STATUS="SpiBaudrateEconPtr" Pointer arithmetic is used
       to efficiently access the SFRs of multiple QSPI Modules.*/
        ModulePtr->ECON[HwChannelno].U =
                           (ConfigPtr->SpiBaudrateEconPtr)[EconCntr].EconVal;
      }
      EconCntr++;
    }while(EconCntr < ConfigPtr->NoOfEconReg);
}

#if (SPI_INITCHECK_API == STD_ON)
/*******************************************************************************
** Traceability : []
** Syntax       : IFX_LOCAL_INLINE Std_ReturnType Spi_lSlaveHwCheckConfigExtn **
** (                                                                          **
**   const Spi_ConfigType* ConfigPtr                                          **
** )                                                                          **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : ConfigPtr  -   init config pointer                      **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : E_OK if ECON registers match else E_NOT_OK.             **
**                                                                            **
** Description      : Function to Check the ECON register Parameters          **
*******************************************************************************/
IFX_LOCAL_INLINE Std_ReturnType Spi_lSlaveHwCheckConfigExtn
(
  const Spi_ConfigType* ConfigPtr
)
{

    Ifx_QSPI* ModulePtr;
    Ifx_QSPI_ECON EconReg;
    uint8 HwChannelno;
    Std_ReturnType RetVal;
    uint32 ReadValue;
    volatile uint32 CompareValue;
    uint8 AsilModule;
    uint8 EconCntr;

    CompareValue = SPI_INITCHK_COMP_VALUE;
    RetVal = E_OK;
    EconCntr = 0U;

    do
    {
      /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used
       to efficiently access the SFRs of multiple QSPI Modules.*/
      AsilModule = ((ConfigPtr->SpiBaudrateEconPtr)[EconCntr].QSPIHwUnit
                                                           & SPI_HWUNIT_MASK);
  
     if(
        ((uint32)SPI_ASIL_MASTER_MODULE_USED & \
                                         ((uint32)0x01U << AsilModule)) == 1U
       )
     {
 /*IFX_MISRA_RULE_17_04_STATUS="SpiBaudrateEconPtr" Pointer arithmetic is used
       to efficiently access the SFRs of multiple QSPI Modules.*/
        HwChannelno = ((((ConfigPtr->SpiBaudrateEconPtr)[EconCntr].QSPIHwUnit)\
                          >> SPI_HWUNIT_CH_SHIFT) & SPI_QSPI_HWCHANNELNO_MASK);

      /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away
       volatile in terms of pointer access.*/
/*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used
       to efficiently access the SFRs of multiple QSPI Modules.*/
        ModulePtr =  &(SPI_HW_MODULE[(uint8)SPI_SLAVE_MODULE_INDEX]);

        /*check if respective ECONz sfr value matches*/
        ReadValue = ModulePtr->ECON[HwChannelno].U;

        /* Read parameters of ECON register */
/*IFX_MISRA_RULE_17_04_STATUS="SpiBaudrateEconPtr" Pointer arithmetic is used
       to efficiently access the SFRs of multiple QSPI Modules.*/
        EconReg.U = (ConfigPtr->SpiBaudrateEconPtr)[EconCntr].EconVal;

        CompareValue &= (ReadValue ^ ~((uint32)EconReg.U));
  
        if(CompareValue != SPI_INITCHK_COMP_VALUE)
        {
          RetVal = E_NOT_OK;
          break;
        }
     }
     EconCntr++;
    }while(EconCntr < ConfigPtr->NoOfEconReg);

    return(RetVal);
}
#endif /* SPI_INITCHECK_API == STD_ON */
#endif /* SPI_BAUDRATE_AT_RUNTIME == STD_OFF */

/*******************************************************************************
** Syntax           : static void Spi_lSlaveHwSetChannelConfig                **
** (                                                                          **
**   uint32 Module,                                                           **
**   uint16 DataConfig,                                                       **
**   uint32 DelayAndHwChNo                                                    **
**   uint8 ParityConfig                                                       **
** )                                                                          **
** [/cover]                                                                   **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Asynchronous                                            **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : Module - Hw module .                                    **
**                    DataConfig  -   Data Config parameters                  **
**                    DelayAndHwChNo  -   Delay                               **
**                    ParityConfig  -   Parity Configuration                  **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : The function shall configure the spi slave              **
**                    channel parameters in the hardware                      **
*******************************************************************************/
static void Spi_lSlaveHwSetChannelConfig(volatile uint32 Module,
                uint16 DataConfig,uint32 DelayAndHwChNo, uint8 ParityConfig)
{
  /* DataConfig contains MSB, DL,Byte, */
  Ifx_QSPI_BACON BaconReg;
  volatile Ifx_QSPI* ModulePtr;
  uint32 TimeDelay;
  uint32 Temp;

  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ModulePtr = &(SPI_HW_MODULE[Module]);
  ModulePtr->FLAGSCLEAR.U = SPI_QSPI_FLAGSCLEAR_VALUE;
  BaconReg.U = ModulePtr->BACON.U;
  TimeDelay = DelayAndHwChNo & SPI_CONFIG_TIMEDELAY_MASK;

  Temp = BaconReg.U ;
  Temp = Temp & (~SPI_QSPI_TIMEDELAY_MASK) ;
  Temp = Temp | TimeDelay;
  BaconReg.U = Temp;

