HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
  /* Channel select */
  BaconReg.B.CS  = (uint8)(DelayAndHwChNo >> SPI_CONFIG_HWCHANNELNO_SHIFT);

  #if(SPI_SLAVE_FLIP_TRANSFERSTART == STD_ON)
  BaconReg.B.MSB = (uint8)(~(uint8)((DataConfig >> SPI_CONFIG_MSB_SHIFT) &
                      SPI_CONFIG_MSB_MASK)) ;  /* 1 = MSB or 0 = LSB */
  #else
  BaconReg.B.MSB = (uint8)(DataConfig >> SPI_CONFIG_MSB_SHIFT) &
                      SPI_CONFIG_MSB_MASK ; /* 1 = MSB or 0 = LSB */

  #endif

  BaconReg.B.BYTE = SPI_QSPI_DL_BIT_SELECT; /* 1 = bytes or  0 = bits */

  /* data length in bits  */
  BaconReg.B.DL = ((uint8)DataConfig & SPI_CONFIG_DATALENGTH_MASK) ;

  if ( ParityConfig != SPI_QSPI_PARITY_UNUSED )
  {
    BaconReg.B.PARTYP = ParityConfig;
  }
  else
  {
    /*Do Nothing since parity is not enabled in ECONz register*/
  }

  ModulePtr->BACONENTRY.U = BaconReg.U;
  Spi_lSlaveWriteTransmit();
}

#if (SPI_CANCEL_API == STD_ON)
/*******************************************************************************
** Traceability : [cover parentID=         ]                                  **
** Syntax:           void Spi_lSlaveCancel                                    **
**                   (                                                        **
**                     Spi_SequenceType        Sequence                       **
**                   )                                                        **
** [/cover]                                                                   **
**                                                                            **
**                                                                            **
** Service ID:       0x0                                                      **
**                                                                            **
** Sync/Async:       Asynchronous                                             **
**                                                                            **
** Reentrancy:       reentrant                                                **
**                                                                            **
** Parameters (in):  Sequence                                                 **
**                                                                            **
** Parameters (out): none                                                     **
**                                                                            **
** Return value:     none                                                     **
**                                                                            **
** Description : This service cancel the specified on-going                   **
** sequence transmission without cancelling any Job transmission and the SPI  **
** Handler/Driver will set the sequence result to SPI_SEQ_CANCELLED.          **
** The SPI Handler/Driver is not responsible on external devices damages or   **
** undefined state due to cancelling a sequence transmission. It is up to the **
** user to be aware of what user is doing!                                    **
*******************************************************************************/
void Spi_lSlaveCancel(Spi_SequenceType Sequence)
{
  #if (SPI_LEVEL_DELIVERED != 0U)
  Spi_JobAndSeqAccessType   *JobSeqDataPtr;

  const Spi_SequenceConfigType* ParamSeqConfigPtr;
  uint32 JobCounter;
  Spi_JobType JobId;

  JobSeqDataPtr = &Spi_SlaveJobAndSeqAccess;
  #endif
  /* Semaphore to protect SeqCancelStatus */
  SchM_Enter_Spi_Cancel();
  /* Set Sequence Cancelled */
  Spi_lSlaveSetSeqStatus(Sequence, SPI_SEQ_CANCELED);
  /* If the Sequence is not the current running sequence, then set the
     sequence to OK so that it can be started again */
  #if (SPI_LEVEL_DELIVERED != 0U) /*Used Only in Async Mode*/
  #if (SPI_LEVEL_DELIVERED == 2U)
  if (   (Sequence !=
           JobSeqDataPtr->JobLinkedSeq[JobSeqDataPtr->StartIndexExtractJobId])
        && (Sequence >= Spi_kConfigPtr->NoOfSyncSequences)
      )
  {
    Spi_lSlaveSetSeqStatus(Sequence, SPI_SEQ_OK);
    /* Set the Shadow Flag to indicate that the sequence is cancelled for the
       status functions.
       This is need because the main status variable SeqStatus is set
       to SPI_SEQ_OK so that the cancelled sequence can be started again.
       Also the cancelled sequence does not block other sequences that
       shares a job with this sequence */
    Spi_lSlaveSetSeqCancelStatus(Sequence);
  }
  #else
  if ( (Sequence !=
          JobSeqDataPtr->JobLinkedSeq[JobSeqDataPtr->StartIndexExtractJobId])
      )
  {
      Spi_lSlaveSetSeqStatus(Sequence, SPI_SEQ_OK);
      /* Set the Shadow Flag to indicate that the sequence is cancelled for the
       status functions.
       This is need because the main status variable SeqStatus is set
       to SPI_SEQ_OK so that the cancelled sequence can be started again.
       Also the cancelled sequence does not block other sequences that
       shares a job with this sequence */
      Spi_lSlaveSetSeqCancelStatus(Sequence);
    }
  #endif
      /* Set the status of All queued Jobs in that seq to ok */
      /*IFX_MISRA_RULE_17_04_STATUS="SpiSequenceConfigPtr" Pointer arithmetic
        used due to PBConfigStructure and is within allowed range.*/
      ParamSeqConfigPtr= &(Spi_kSlaveConfigPtr->SpiSequenceConfigPtr[Sequence]);
      JobCounter = 0U;

      /*IFX_MISRA_RULE_17_04_STATUS="JobLinkPtr" Pointer arithmetic used due to
        PBConfigStructure and is within allowed range.*/
      while (
      JobSeqDataPtr->JobQueue[JobSeqDataPtr->StartIndexExtractJobId] !=
                   ParamSeqConfigPtr->JobLinkPtr[JobCounter])
      {
        /*IFX_MISRA_RULE_17_04_STATUS="JobLinkPtr" Pointer arithmetic used due
          to PBConfigStructure and is within allowed range.*/
        if (ParamSeqConfigPtr->JobLinkPtr[JobCounter] == \
                                                 SPI_JOB_LINK_DELIMITER)
        {
          break;
        }
        JobCounter++;
      }

        /*IFX_MISRA_RULE_17_04_STATUS="JobLinkPtr" Pointer arithmetic used due
          to PBConfigStructure and is within allowed range.*/
        while (ParamSeqConfigPtr->JobLinkPtr[JobCounter] != \
                                                 SPI_JOB_LINK_DELIMITER)
        {
          /* extract each job id from the sequence */
          /*IFX_MISRA_RULE_17_04_STATUS="JobLinkPtr" Pointer arithmetic used due
            to PBConfigStructure and is within allowed range.*/
          JobId = ParamSeqConfigPtr->JobLinkPtr[JobCounter];

          Spi_lSlaveSetJobStatusAtomic(JobId,SPI_JOB_OK );
          JobCounter++;
        }
   #endif

    /* Exit Critical Section */
    SchM_Exit_Spi_Cancel();
  }

#endif

