HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
#if ((SPI_CANCEL_API == STD_ON) && (SPI_LEVEL_DELIVERED != 0U))
/*******************************************************************************
** Traceability : [cover parentID=     ]                                      **
**                                                                            **
** Syntax : IFX_LOCAL_INLINE void Spi_lSlaveSetSeqCancelStatus                **
**                                      (Spi_SequenceType Seq)                **
** [/cover]                                                                   **
**                                                                            **
** Service ID:  NA                                                            **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non reentrant                                                 **
**                                                                            **
** Parameters (in) :  Seq - Sequence Id                                       **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value    :  void                                                    **
**                                                                            **
** Description      : To set the sequence to cancelled state                  **
*******************************************************************************/
IFX_LOCAL_INLINE void Spi_lSlaveSetSeqCancelStatus(Spi_SequenceType Seq)
{
  uint16 Index;
  /* ASIL or QM sequence index from map configuration*/
  Index = (uint16)((uint16)Spi_kSlaveConfigPtr->SpiMapConfigPtr->SeqIndex[Seq]
          >> SPI_SEQUENCE_INDEX);
  Spi_SlaveSeqStatus[Index].AsilSeqCancelStatus = \
      Spi_SlaveSeqStatus[Index].AsilSeqCancelStatus |\
     ((uint32)SPI_SEQ_CANCELED << (SPI_SEQUENCE_STATUS_BITS * \
                          (Seq & SPI_SEQUENCE_BIT_POSITION)));
}
#endif

/*******************************************************************************
** Syntax           : IFX_LOCAL_INLINE void Spi_lSlaveSeqCancelled(           **
                           Spi_JobAndSeqAccessType *JobSeqDataPtr)            **
**                                                                            **
** Service ID       : NA                                                      **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Reentrant                                               **
**                                                                            **
** Parameters (in)  : None.                                                   **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : None.                                                   **
**                                                                            **
** Description      : Function to set the status of sequence cancelled to     **
**                    cancel                                                  **
*******************************************************************************/
#if (SPI_CANCEL_API == STD_ON)
IFX_LOCAL_INLINE void Spi_lSlaveSeqCancelled(Spi_JobAndSeqAccessType \
                                                            *JobSeqDataPtr)
{
  uint8 Seqbool;
  uint8 NextSeqId;
  uint16 StartIndex;

  /*Fix for AI00254397 */
  SchM_Enter_Spi_Cancel();
  StartIndex = JobSeqDataPtr->StartIndexExtractJobId;
  Seqbool = 0U;
  while ((StartIndex != JobSeqDataPtr->EndIndex) && (Seqbool == 0U))
  {
    NextSeqId = JobSeqDataPtr->JobLinkedSeq[StartIndex];
    if (Spi_lSlaveGetSeqStatus(NextSeqId) == SPI_SEQ_CANCELED)
    {
      #if(SPI_LEVEL_DELIVERED != 0U)
      Spi_lSlaveSetSeqCancelStatus(NextSeqId);
      #endif
      StartIndex = Spi_lIncrementAndRoundIndex(StartIndex);
    }
    else
    {
      Seqbool = 1U;
    }
  }
  JobSeqDataPtr->StartIndexExtractJobId = StartIndex;
  SchM_Exit_Spi_Cancel();
}
#endif
 /*(SPI_CANCEL_API == STD_ON) */

#if ( SPI_INITCHECK_API == STD_ON )
/*******************************************************************************
** Traceability : [cover parentID=DS_MCAL_SPI_9802,DS_MCAL_SPI_9803,          **
DS_MCAL_SPI_9846,SAS_MCAL_SPI_9804]                                      **
**                                                                            **
** Syntax : Std_ReturnType Spi_lSlaveInitCheck                                **
                                        (const Spi_ConfigType* ConfigPtr)     **
** [/cover]                                                                   **
**                                                                            **
** Service ID:  NA                                                            **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non reentrant                                                 **
**                                                                            **
** Parameters (in) :  ConfigPtr - Pointer to configuration set                **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value    :  Std_ReturnType                                          **
**                                                                            **
** Description      : This function checks is the initialization of the       **
**                    SPI hardware unit and driver done according to the      **
**                    configuration set referenced by ConfigPtr.              **
*******************************************************************************/
Std_ReturnType Spi_lSlaveInitCheck(const Spi_ConfigType* ConfigPtr)
{
  const Spi_HWModuleConfigType* HWModuleConfigPtr;
  uint32                        ReadValue;
  volatile uint32               CompareValue;
  Dma_ChannelType               DmaRxChannel;
  Std_ReturnType                RetVal;
  /* initialize compare value */
  CompareValue = SPI_INITCHK_COMP_VALUE;
  RetVal = E_OK;
  /*  Get Hardware pointer for slave QSPI*/
  HWModuleConfigPtr = (ConfigPtr->HWModuleConfigPtr[SPI_SLAVE_MODULE_INDEX]);
  /* check for clock initialization */
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ReadValue = (uint32)SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].CLC.U;
  CompareValue &= (ReadValue ^ ~((uint32)
                                       HWModuleConfigPtr->HWClkSetting));
  /* Check for GLOBALCON register */
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ReadValue = (uint32)SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].GLOBALCON.U;
  CompareValue &= (ReadValue ^ ~((uint32)SLAVE_QSPI_GLOBCON_RSTVAL));
  /* Check for PISEL register (clock input select and slave receive signal) */
  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  ReadValue = (uint32)SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].PISEL.U;
  CompareValue &= (ReadValue ^ ~((uint32)HWModuleConfigPtr->HWPinSetting));

#if(SPI_BAUDRATE_AT_RUNTIME == STD_OFF)
  /*Check the ECON register values */
  RetVal = RetVal | Spi_lSlaveHwCheckConfigExtn(ConfigPtr);
#endif /* SPI_BAUDRATE_AT_RUNTIME == STD_OFF */

  /* Checking DMA specific registers */
  RetVal = RetVal | Spi_lSlaveHwDmaSfrInitCheck();
  DmaRxChannel  = Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel;

  /* write only - hence ignored
    IntrSrc.CLRR,SWSCLR and IOVCLR are write only bits */
  ReadValue = (uint32)MODULE_SRC.QSPI.QSPI[SPI_SLAVE_MODULE_INDEX].RX.B.TOS
                                                          | SPI_SRCREG_TOS_DMA;
  CompareValue &= (ReadValue ^ ~((uint32)SPI_SRCREG_TOS_DMA));
  ReadValue = (uint32)MODULE_SRC.QSPI.QSPI[SPI_SLAVE_MODULE_INDEX].RX.B.SRPN;
  CompareValue &= (ReadValue ^ ~((uint32)(uint8)DmaRxChannel));
  ReadValue = (uint32)MODULE_SRC.QSPI.QSPI[SPI_SLAVE_MODULE_INDEX].RX.B.SRE;
  CompareValue &= (ReadValue ^ ~((uint32)0U));
  /* Check for all the global variables */
  RetVal = RetVal | Spi_lSlaveInitGlobalVarCheck();
  if ( (CompareValue != SPI_INITCHK_COMP_VALUE) || (RetVal != E_OK) )
  {
    RetVal = E_NOT_OK;
  }
  return RetVal;
}

