HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
/*******************************************************************************
** Syntax : static Std_ReturnType Spi_lSlaveHwDmaSfrInitCheck(void)           **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Re-entrant                                                    **
**                                                                            **
** Parameters (in) : None                                                     **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : Std_ReturnType                                           **
**                                                                            **
**                                                                            **
** Description :  Returns E_OK if all the sfr values are as initialised       **
**                else returns E_NOT_OK                                       **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Spi_lSlaveHwDmaSfrInitCheck(void)
{
  Ifx_SRC_SRCR_Bits IntrSrc;
  volatile Ifx_SRC_SRCR_Bits *MoveEngCh0BaseAddr;
  Dma_ChannelType   DmaReceiveChannel = DMA_CHANNEL_INVALID;
  uint32            Address,RemapAddress;
  uint32            ReadValue;
  volatile uint32   CompareValue;

  Std_ReturnType    RetVal;

  MoveEngCh0BaseAddr = SRC_DMACH0ADDR;
  CompareValue = SPI_INITCHK_COMP_VALUE;

  ReadValue = (uint32)MODULE_DMA.CLC.U;
  CompareValue &= (ReadValue ^ ~((uint32)8U));

  RetVal = E_NOT_OK;
  CompareValue = SPI_INITCHK_COMP_VALUE;

  DmaReceiveChannel  = Spi_SlaveChnlAccess[0U].DmaChannelIdx.RxDmaChannel;

  /*IFX_MISRA_RULE_11_05_STATUS="SPI_HW_MODULE" attempt to cast away volatile in
    terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="SPI_HW_MODULE" Pointer arithmetic is used to
    efficiently access the SFRs of multiple QSPI Modules.*/
  Address = ((uint32)&(SPI_HW_MODULE[SPI_SLAVE_MODULE_INDEX].RXEXIT.U));

  /* Check Source Address */
  RemapAddress = Mcal_GetDsprReMapAddress(Address);
  ReadValue = (uint32)MODULE_DMA.CH[DmaReceiveChannel].SADR.U;
  CompareValue &= (ReadValue ^ ~(RemapAddress));

  /* Check channel control register */
  ReadValue = (uint32)MODULE_DMA.CH[DmaReceiveChannel].CHCFGR.U;
  CompareValue &= (ReadValue ^ ~((uint32)DMA_CHCFGR_RESETVAL));

  ReadValue = (uint32)MODULE_DMA.CH[DmaReceiveChannel].CHCSR.U;
  CompareValue &= (ReadValue ^ ~((uint32)
                                         ReadValue & (DMA_CHCSR_SCH_CLR_MASK)));

  ReadValue = (uint32)MODULE_DMA.TSR[DmaReceiveChannel].U;
  CompareValue &= (ReadValue ^ ~((uint32)
                                     (ReadValue &
                                     ((~((uint32)1U << DMA_TSR_ECH_BIT_POS))
                                     | ( (uint32)1U << DMA_TSR_DCH_BIT_POS)))));

  /*Check for Mcal_DmaChClrIntrFlags(DmaReceiveChannel) ;*/
  ReadValue = (uint32)MODULE_DMA.CH[DmaReceiveChannel].CHCSR.U;
  CompareValue &= (ReadValue ^ ~((uint32) ReadValue  | 0U));

  ReadValue = (uint32)MODULE_DMA.TSR[DmaReceiveChannel].U;
  CompareValue &= (ReadValue ^ ~((uint32)ReadValue | 0U));

  /* DMA Error Initialization */
  ReadValue = (uint32)MODULE_DMA.CH[DmaReceiveChannel].ADICR.B.ETRL;
  CompareValue &= (ReadValue ^ ~((uint32)1U));

  /* Check Interrupt Control  */
  ReadValue = (uint32)MODULE_DMA.CH[DmaReceiveChannel].ADICR.B.INTCT;
  CompareValue &= (ReadValue ^ ~((uint32)SPI_DMA_INTCT));

  /* the following registers are updated for INTERRUPT mode only and not
  applicable for POLLING MODE. However when safety is ON it is mandated
  that the user switches to INTERRUPT mode immediately after initalisation
  and before Spi_lSlaveInitCheck is called */

  /*IFX_MISRA_RULE_11_05_STATUS="MoveEngCh0BaseAddr" attempt to cast away
    volatile in terms of pointer access.*/
  /*IFX_MISRA_RULE_17_04_STATUS="MoveEngCh0BaseAddr" Pointer arithmetic is used
    to efficiently access the SFRs of multiple QSPI Modules.*/
  IntrSrc = *((volatile Ifx_SRC_SRCR_Bits *)(void *)MoveEngCh0BaseAddr +
                                      DmaReceiveChannel);
  ReadValue = (uint32)IntrSrc.SRE;
  CompareValue &= (ReadValue ^ ~((uint32)1U));

  if (CompareValue == SPI_INITCHK_COMP_VALUE)
  {
    RetVal = E_OK;
  }

  return (RetVal);

}

/*******************************************************************************
** Syntax : static Std_ReturnType Spi_lSlaveInitGlobalVarCheck(void)          **
**                                                                            **
** Service ID:  None                                                          **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Re-entrant                                                    **
**                                                                            **
** Parameters (in) : None                                                     **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : Std_ReturnType                                           **
**                                                                            **
**                                                                            **
** Description :  Returns E_OK if all the global variable values are          **
**                as initialised else returns E_NOT_OK                        **
**                                                                            **
*******************************************************************************/
static Std_ReturnType Spi_lSlaveInitGlobalVarCheck(void)
{
  uint32            Index;
  uint32            ReadValue;
  volatile uint32   CompareValue;
  Std_ReturnType    RetVal;

  CompareValue = SPI_INITCHK_COMP_VALUE;
  RetVal = E_NOT_OK;

  ReadValue = (uint32)Spi_SlaveBusStatus;
  CompareValue &= (ReadValue ^ ~((uint32)SPI_IDLE));

