HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_SPI/SpiSlave.c
  #if ((SPI_LEVEL_DELIVERED == 1U) || (SPI_LEVEL_DELIVERED == 2U))

  #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)
  for(Index = 0U; Index < SPI_MAX_JOB_TRIG_Q_LENGTH; Index++)
  {
    ReadValue = (uint32)0U;
    CompareValue &= (ReadValue ^ ~((uint32)Spi_SlaveJobAndSeqAccess.\
                                                     JobQueueRearrange[Index]));

    ReadValue = (uint32)0U;
    CompareValue &= (ReadValue ^ ~((uint32)Spi_SlaveJobAndSeqAccess.\
                                            JobLinkedSequenceRearrange[Index]));
  }
  #endif

  ReadValue = (uint32)(Spi_kSlaveConfigPtr->\
      HWModuleConfigPtr[SPI_SLAVE_MODULE_INDEX]->SpiDmaConfigPtr->RxDmaChannel);
  CompareValue &= (ReadValue ^ ~((uint32)Spi_SlaveChnlAccess[0U].\
                                                   DmaChannelIdx.RxDmaChannel));

  #if (SPI_INTERRUPTABLE_SEQUENCE_ALLOWED == STD_ON)
  /* Set Index to the last Sequence */
  Index = Spi_kSlaveConfigPtr->NoOfSequences;
  do
  {
    Index--;

    ReadValue = (uint32)0U;
    CompareValue &= (ReadValue ^ ~((uint32)Spi_SlaveJobAndSeqAccess.\
                                                       CurrentJobIndex[Index]));
  }while (Index > 0U);
  #else
  ReadValue = (uint32)0U;
  CompareValue &= (ReadValue ^ ~((uint32)Spi_SlaveJobAndSeqAccess.\
                                                              CurrentJobIndex));
  #endif
  #endif
  /* ((SPI_LEVEL_DELIVERED == 1U) || (SPI_LEVEL_DELIVERED == 2U))  */

  /* The following global variables are common to all levels */
  Index = 0U;
  #if (SPI_JOB_ASIL_ARRAY_INDEX > 1U)
  do
  {
  #endif
    ReadValue = (uint32)0U;
    CompareValue &= (ReadValue ^ ~((uint32)Spi_SlaveJobResult[Index]));
  #if (SPI_JOB_ASIL_ARRAY_INDEX > 1U)
    Index++;
  }while (Index < SPI_JOB_ASIL_ARRAY_INDEX);
  #endif

  Index = 0U;
  #if (SPI_SEQUENCE_ASIL_ARRAY_INDEX > 1U)
  do
  {
  #endif
    ReadValue = (uint32)0U;
    CompareValue &= (ReadValue ^ ~((uint32)Spi_SlaveSeqStatus[Index].\
                                                                AsilSeqStatus));
  #if (SPI_SEQUENCE_ASIL_ARRAY_INDEX > 1U)
    Index++;
  }while (Index < SPI_SEQUENCE_ASIL_ARRAY_INDEX);
  #endif

  #if  (SPI_LEVEL_DELIVERED != 0U)
  Index = 0U;
  do
  {
    ReadValue = (uint32)SPI_SEQ_IDLE_ID;
    CompareValue &= (ReadValue ^ ~((uint32)Spi_SlaveJobAndSeqAccess.\
                                                          JobLinkedSeq[Index]));

    ReadValue = (uint32)SPI_JOB_IDLE_ID;
    CompareValue &= (ReadValue ^ ~((uint32)Spi_SlaveJobAndSeqAccess.\
                                                              JobQueue[Index]));
    Index++;
  }while (Index < SPI_MAX_JOB_TRIG_Q_LENGTH);
  #endif

  if (CompareValue == SPI_INITCHK_COMP_VALUE)
  {
    RetVal = E_OK;
  }
  return (RetVal);
}
#endif
/* End of Function: Spi_lSlaveInitCheck */
/* (SPI_INITCHECK_API == STD_ON) */

/*Memory Map of the SPI SLAVE Code*/
#define SPI_STOP_SEC_CODE
/*
  Allows to map variables, constants and code of modules to individual
  memory sections.
*/
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
allowed only for MemMap.h*/
#include "MemMap.h"

#endif
/* (SPI_SLAVE_ENABLE == STD_ON)*/
/*******************************************************************************
**                            General Notes                                   **
*******************************************************************************/

